{
  "phase1": {
    "name": "Phase 1: Tier 4 Content",
    "description": "The first raiding tier of The Burning Crusade. Introduces players to 10-man and 25-man raid content. Most guilds start with Karazhan to gear up before attempting the 25-man raids.",
    "raids": {
      "karazhan": {
        "name": "Karazhan",
        "shortName": "Kara",
        "size": 10,
        "location": "Deadwind Pass, Eastern Kingdoms",
        "attunement": "The Master's Key",
        "attunementSteps": [
          "1. Pick up quest from Archmage Alturus outside Karazhan entrance",
          "2. Complete Shadow Labyrinth (final boss drops First Key Fragment)",
          "3. Complete Steamvault (final boss drops Second Key Fragment)",
          "4. Complete Arcatraz (final boss drops Third Key Fragment)",
          "5. Return to Archmage Alturus to receive The Master's Key"
        ],
        "description": "The haunted tower of the Last Guardian, Medivh. This iconic 10-player raid is the entry point for most guilds and features diverse boss mechanics across multiple wings. Expect to spend 3-4 hours on early clears, eventually getting down to 2 hours with gear.",
        "recommendedComposition": {
          "tanks": 2,
          "healers": 3,
          "dps": 5,
          "notes": "Bring at least one Mage or Druid for decursing. A Priest is highly valuable for Shackle Undead on Moroes. Having a Warlock makes several fights easier."
        },
        "minimumGear": {
          "tanks": "12,000+ health unbuffed, 490 Defense (crit immune), 12,000+ armor",
          "healers": "1,000+ healing power, 7,000+ mana",
          "dps": "Pre-raid Best in Slot gear from heroic dungeons recommended"
        },
        "tierTokens": "Tier 4 Gloves and Helm tokens drop from Curator and Prince Malchezaar",
        "bosses": [
          {
            "name": "Attumen the Huntsman",
            "npcId": 15550,
            "difficulty": "Easy",
            "description": "The ghostly huntsman of Karazhan, accompanied by his spectral steed Midnight. This is the first boss most groups will encounter. The fight has three phases based on Midnight's health percentage.",
            "phaseBreakdown": [
              "Phase 1 (100% to 95% Midnight HP): Only Midnight is active. Tank and damage Midnight.",
              "Phase 2 (95% to 25% Midnight HP): Attumen spawns and must be picked up by a second tank. Both must be tanked facing away from the raid.",
              "Phase 3 (25% Midnight HP): Attumen mounts Midnight, combining into a single target. Single tank needed, burn the boss down."
            ],
            "abilities": [
              {
                "name": "Shadow Cleave",
                "spellId": 29832,
                "description": "A frontal cone attack dealing approximately 4,000 shadow damage to anyone in front of the boss.",
                "handling": "The tank must always face Midnight and Attumen away from the raid. Melee damage dealers should position themselves behind the boss at all times. Never stand in front of either target."
              },
              {
                "name": "Intangible Presence",
                "spellId": 29833,
                "description": "A curse applied to random players that reduces their chance to hit by 50% for 15 seconds. This severely cripples damage output and can cause the tank to lose threat.",
                "handling": "Mages and Druids must remove this curse immediately. Priority order: Tank first, then melee damage dealers, then ranged/casters. A cursed tank can lose aggro and cause a wipe."
              },
              {
                "name": "Charge",
                "spellId": 29847,
                "description": "After merging in Phase 3, the mounted Attumen will charge random raid members, dealing approximately 2,000 damage and knocking them back.",
                "handling": "Ranged players and healers should spread out loosely, staying at least 20 yards from the boss. Avoid standing near edges or ledges where knockback could be fatal."
              }
            ],
            "strategy": "Phase 1: Your main tank grabs Midnight and faces it away from the group. All damage dealers attack Midnight until it reaches 95% health. Phase 2: When Attumen spawns, your off-tank (second tank) must immediately pick him up with a taunt. Keep both targets faced away from the raid. Focus damage on Attumen until Midnight reaches 25% health. Phase 3: The two merge into a mounted form. Your main tank takes over while the off-tank can switch to damage. Remove curses constantly and burn the boss down. Use consumables like health potions if your group is undergeared.",
            "commonMistakes": [
              "Standing in front of either target and getting cleaved",
              "Not decursing the tank, causing them to miss attacks and lose threat",
              "Tank getting knocked off the platform by Charge in Phase 3"
            ],
            "lootHighlights": [
              "Attumen's Signet",
              "Stalker's War Bands",
              "Midnight's Signet"
            ]
          },
          {
            "name": "Moroes",
            "npcId": 15687,
            "difficulty": "Medium",
            "description": "The undead steward of Karazhan. Moroes is a rogue-type boss accompanied by four randomly selected dinner guests. This fight tests your raid's ability to use crowd control effectively while managing a deadly bleed debuff.",
            "guestList": [
              "Baroness Dorothea Millstipe - Shadow Priest (can Mind Flay, dangerous)",
              "Baron Rafe Dreuger - Retribution Paladin (moderate threat)",
              "Lady Catriona Von'Indi - Holy Priest (will heal, top priority kill)",
              "Lady Keira Berrybuck - Holy Paladin (will heal and cleanse)",
              "Lord Robin Daris - Arms Warrior (Mortal Strike, moderate threat)",
              "Lord Crispin Ference - Protection Warrior (low priority, can be left for last)"
            ],
            "abilities": [
              {
                "name": "Garrote",
                "spellId": 37066,
                "description": "After vanishing, Moroes applies this deadly bleed to a random player. It deals 1,000 damage every 3 seconds for FIVE MINUTES and cannot be dispelled by normal means. Total damage: over 100,000 if not removed.",
                "handling": "Only specific abilities can remove Garrote: Dwarf Stoneform racial, Paladin Blessing of Protection, Mage Ice Block, and Paladin Divine Shield. Save these abilities for when Garrote lands on a healer. If none of these counters are available, healers must simply heal through the damage - assign one healer per Garrote target if multiple people are affected."
              },
              {
                "name": "Gouge",
                "spellId": 29425,
                "description": "Moroes gouges his current target, stunning them for 6 seconds. He then attacks whoever is second on his threat list.",
                "handling": "You MUST have two tanks for this fight. When the main tank gets gouged, the off-tank must immediately taunt Moroes. If there is no off-tank ready, Moroes will likely run to a healer and kill them instantly. Communicate when Gouge is coming."
              },
              {
                "name": "Blind",
                "spellId": 34654,
                "description": "A poison effect that disorients a nearby player for 10 seconds.",
                "handling": "Can be dispelled with Abolish Poison or Paladin Cleanse. Lower priority than other mechanics, but annoying if it hits a healer during a critical moment."
              },
              {
                "name": "Vanish",
                "spellId": 29448,
                "description": "Moroes vanishes into the shadows, becomes untargetable, and then applies Garrote to a random raid member before returning to attack the highest threat target.",
                "handling": "This cannot be prevented. It occurs roughly every 30 seconds. When Moroes vanishes, prepare to heal whoever gets Garrote. The tank should be ready to pick him back up when he reappears."
              }
            ],
            "strategy": "Before pulling, assign crowd control to the guests. Priests should Shackle Undead the Holy Priest and Shadow Priest guests. Mages can Polymorph the Paladin guests. Hunters can Freezing Trap warriors. Kill order: Holy Priest (Lady Catriona) first to stop healing, then Shadow Priest (Baroness Dorothea), then Holy Paladin (Lady Keira), then Retribution Paladin (Baron Rafe), then Warriors, and finally Moroes himself. Keep two tanks on Moroes at all times trading threat. Save Blessing of Protection, Stoneform, Ice Block, and Divine Shield for when Garrote lands on healers. After all guests are dead, it becomes a tank-and-spank while healing through Garrote damage.",
            "commonMistakes": [
              "Not having crowd control break and adds running loose",
              "Only having one tank and losing players to Gouge",
              "Wasting Garrote removal abilities early instead of saving them for healers",
              "Killing guests in the wrong order and letting healers prolong the fight"
            ],
            "lootHighlights": [
              "Crimson Girdle of the Indomitable",
              "Royal Cloak of the Sunstriders",
              "Moroes' Lucky Pocket Watch"
            ]
          },
          {
            "name": "Maiden of Virtue",
            "npcId": 16457,
            "difficulty": "Medium",
            "description": "A holy construct found in the Guest Chambers. This fight punishes melee with constant holy damage and periodically stuns the entire raid. Positioning and dispelling are critical.",
            "abilities": [
              {
                "name": "Repentance",
                "spellId": 29511,
                "description": "Every 25-35 seconds, Maiden incapacitates the ENTIRE RAID for 12 seconds. During this time, no one can act, cast, or heal.",
                "handling": "Paladin Blessing of Sacrifice on a healer will break them out instantly when Maiden's aura damages them. Warrior Berserker Rage makes you immune. PvP trinkets and Undead Will of the Forsaken also work. Before Repentance, healers should apply heal-over-time effects on the raid. Having at least one person break out early to heal is critical."
              },
              {
                "name": "Holy Fire",
                "spellId": 29522,
                "description": "A damage-over-time effect on a random target dealing approximately 3,000 holy damage over 12 seconds.",
                "handling": "DISPEL THIS IMMEDIATELY - it is your top priority. Assign two players to dispel duty (Priests and Paladins). Multiple people can have this at once, so dispellers need to be vigilant."
              },
              {
                "name": "Holy Ground",
                "spellId": 29512,
                "description": "A consecration aura around Maiden dealing approximately 300 holy damage per second to anyone within 12 yards. It also silences spellcasting.",
                "handling": "Melee damage dealers must accept this damage - healers need to compensate with extra healing. Melee should NOT try to cast instant heals while in range due to the silence. This is unavoidable for melee."
              },
              {
                "name": "Holy Wrath",
                "spellId": 32445,
                "description": "Chain holy damage that jumps between nearby players. The damage DOUBLES with each jump: 500 to first target, 1,000 to second, 2,000 to third, 4,000 to fourth, and so on.",
                "handling": "SPREAD OUT at least 10 yards apart from each other. This is the number one cause of wipes on this boss. Mark positions on the floor if people have trouble maintaining spacing. Never clump up."
              }
            ],
            "strategy": "Positioning is everything on this fight. Before pulling, have everyone spread out in a circle around the boss, at least 10 yards apart from each other. Mark positions on the floor if needed. Assign two dispellers to immediately remove Holy Fire from anyone who gets it. Put Blessing of Sacrifice on a healer so they break out of Repentance early. Melee will take constant damage from Holy Ground - healers must keep them topped off. The fight is straightforward once everyone is positioned correctly.",
            "commonMistakes": [
              "Standing too close to other players and getting chained by Holy Wrath",
              "Not dispelling Holy Fire quickly enough",
              "No one able to break Repentance, causing deaths during the stun",
              "Healers not pre-applying heal-over-time effects before Repentance"
            ],
            "lootHighlights": [
              "Bands of Indwelling",
              "Iron Stalagmite",
              "Bracers of Maliciousness"
            ]
          },
          {
            "name": "Opera Event",
            "npcId": 17603,
            "difficulty": "Medium",
            "description": "A random theatrical event determined when your raid enters Karazhan for the week. Talk to Barnes the Stage Manager to discover which show you'll face. Each show has completely different mechanics, so be prepared for any of them.",
            "variants": [
              {
                "name": "The Big Bad Wolf (Red Riding Hood)",
                "description": "A single-target fight against a werewolf. Periodically, one player is transformed into Little Red Riding Hood.",
                "keyMechanic": "When transformed into Red Riding Hood, you have 50% reduced movement speed, cannot attack, and the Wolf will chase you. If the Wolf catches you, you die instantly.",
                "strategy": "Transformed players must RUN IN CIRCLES around the room. Use any movement abilities you have (Sprint, Dash, Blink, travel form). Other players should slow the Wolf with Frost traps, Hamstring, Crippling Poison, and other snares. The Wolf moves slightly faster than a transformed player, so kiting is essential."
              },
              {
                "name": "Romulo and Julianne",
                "description": "A two-phase fight against star-crossed lovers. Julianne appears first, then Romulo, and finally both together.",
                "keyMechanic": "In the final phase, both must die within 10 seconds of each other. If one dies and the other lives too long, the dead one will resurrect at full health.",
                "strategy": "Kill Julianne first while interrupting her heals with Kick, Pummel, or Earth Shock. Kill Romulo second while dispelling his poison stacks on the tank. In the final phase, balance damage on both and kill them simultaneously. Coordinate damage to bring them both below 5% before finishing them off together."
              },
              {
                "name": "The Wizard of Oz",
                "description": "A council-style fight against characters from the Wizard of Oz: Dorothee, Roar, Strawman, Tinhead, Tito (the dog), and finally The Crone.",
                "keyMechanic": "Each enemy has unique abilities. Dorothee will enrage if Tito dies before her. The Crone only appears after all others are dead.",
                "strategy": "Kill order: Dorothee first (stop her Water Bolt spam), then Roar (fears in melee range), then Tinhead (stuns the tank), then Strawman (interrupt his Fireball), then Tito. After all five die, The Crone appears - she is a simple tank-and-spank."
              }
            ],
            "commonMistakes": [
              "Wolf: Not kiting properly when transformed, getting caught",
              "Romulo and Julianne: Killing one too fast and having them resurrect",
              "Wizard of Oz: Killing Tito before Dorothee, causing her to enrage"
            ],
            "lootHighlights": [
              "Ribbon of Sacrifice",
              "Big Bad Wolf's Head",
              "Romulo's Poison Vial"
            ]
          },
          {
            "name": "The Curator",
            "npcId": 15691,
            "difficulty": "Medium",
            "description": "A massive arcane construct in the Menagerie. This boss tests your raid's ability to balance killing adds while dealing damage to the boss. The key mechanic is Evocation, when the boss becomes vulnerable.",
            "abilities": [
              {
                "name": "Hateful Bolt",
                "spellId": 30383,
                "description": "Every 10 seconds, Curator fires a bolt at the raid member with the HIGHEST health (excluding the main tank) for 4,000-5,000 arcane damage.",
                "handling": "Designate 2-3 'soakers' - plate damage dealers or Hunters using Aspect of the Wild. These players should stay at full health so they absorb the Hateful Bolts instead of healers or cloth wearers. Spread healing across soakers. Arcane resistance gear helps if available."
              },
              {
                "name": "Summon Astral Flare",
                "spellId": 30236,
                "description": "Every 10 seconds, Curator summons an Astral Flare add. These adds have 12,000 health and cast chain lightning at nearby players.",
                "handling": "KILL FLARES IMMEDIATELY. Assign ranged damage dealers to switch to flares as soon as they spawn. If flares stack up, the raid damage becomes overwhelming. Warlocks can Banish flares to buy time."
              },
              {
                "name": "Evocation",
                "spellId": 30254,
                "description": "When Curator reaches 10% mana, he begins channeling Evocation for 20 seconds to restore his mana. During this time, he takes 200% increased damage (double damage).",
                "handling": "THIS IS YOUR BURN PHASE. Save all damage cooldowns (Heroism/Bloodlust, trinkets, potions) for Evocation. The goal is to either kill the Curator before Evocation ends, or deal enough damage to push another Evocation phase quickly."
              },
              {
                "name": "Enrage",
                "spellId": 28747,
                "description": "At 15% health, Curator enrages, increasing his attack speed and damage significantly.",
                "handling": "Save tank defensive cooldowns for the enrage. This should overlap with an Evocation if your damage is good, making it manageable. If you reach enrage outside of Evocation, healers need to work hard to keep the tank alive."
              }
            ],
            "strategy": "Position your raid loosely to avoid chain lightning from flares. Kill every Astral Flare immediately when it spawns - ranged damage dealers should be ready to switch targets. Keep your Hateful Bolt soakers at full health. When Curator runs out of mana and begins Evocation, THIS IS YOUR BURN PHASE. Pop Heroism/Bloodlust, all trinkets, and damage potions. Deal as much damage as possible during the 20-second window. If the boss doesn't die during Evocation, continue killing flares and wait for the next Evocation.",
            "commonMistakes": [
              "Letting Astral Flares stack up because damage dealers don't switch targets",
              "Not having designated soakers, causing random players to die to Hateful Bolt",
              "Using Heroism/Bloodlust at the start instead of saving it for Evocation",
              "Tank dying to enrage because healers weren't prepared"
            ],
            "lootHighlights": [
              "Tier 4 Gloves token",
              "Forest Wind Shoulderpads",
              "Garona's Signet Ring"
            ]
          },
          {
            "name": "Terestian Illhoof",
            "npcId": 15688,
            "difficulty": "Medium-Hard",
            "description": "A satyr warlock in the Repository. This fight requires fast target switching and heavy healing. The key mechanic is Demon Chains, which will kill players if not destroyed quickly.",
            "abilities": [
              {
                "name": "Sacrifice",
                "spellId": 30115,
                "description": "Illhoof chains a random player to a Demon Chains portal, draining 1,500 health per second. The player cannot act while chained. The chains have approximately 12,000 health.",
                "handling": "ALL damage dealers MUST SWITCH TO DEMON CHAINS IMMEDIATELY when someone gets sacrificed. The chained player will die in about 8 seconds if the chains aren't destroyed. This is the number one cause of wipes - prioritize chains above everything else."
              },
              {
                "name": "Summon Kil'rek",
                "spellId": 30066,
                "description": "Kil'rek is Illhoof's imp companion with 75,000 health. While Kil'rek is alive, Illhoof takes 25% reduced damage. Kil'rek respawns 45 seconds after dying.",
                "handling": "Kill Kil'rek at the start of the fight, then focus damage on Illhoof during the 45-second window before Kil'rek returns. When Kil'rek respawns, kill it again and repeat."
              },
              {
                "name": "Summon Imps",
                "spellId": 30067,
                "description": "Illhoof continuously summons waves of small imps. Each imp casts Firebolt for 150-200 damage. While individually weak, many imps casting together creates dangerous raid damage.",
                "handling": "Warlock Seed of Corruption is AMAZING for this fight - place it on Illhoof and the exploding seeds will kill imps. Without a Warlock, use area-of-effect abilities like Consecration, Rain of Fire, or Volley. Don't let imps accumulate or raid damage spikes."
              },
              {
                "name": "Shadow Bolt",
                "spellId": 30055,
                "description": "A 2-second cast dealing 3,000-4,000 shadow damage to a random player.",
                "handling": "Can be interrupted but it's not the priority. Healers should handle this through healing. Focus interrupts on more dangerous casts if needed."
              }
            ],
            "strategy": "Kill Kil'rek immediately when the fight starts. Have your Warlock (if you have one) spam Seed of Corruption on Illhoof - the explosions will kill imps automatically. Without a Warlock, assign someone to area-of-effect the imps. When ANYONE gets Sacrificed to Demon Chains, EVERYONE switches to kill the chains immediately - this is non-negotiable. After the chains break, return to the boss. Kill Kil'rek again each time it respawns (every 45 seconds). This fight requires heavy healing due to constant imp damage.",
            "commonMistakes": [
              "Not switching to Demon Chains fast enough, causing sacrificed players to die",
              "Letting imps stack up because no one is handling area-of-effect damage",
              "Forgetting to kill Kil'rek when it respawns, reducing damage on Illhoof",
              "Healers falling behind on the constant raid damage"
            ],
            "lootHighlights": [
              "Gilded Thorium Cloak",
              "Fool's Bane",
              "Cincture of Will"
            ]
          },
          {
            "name": "Shade of Aran",
            "npcId": 16524,
            "difficulty": "Hard",
            "description": "The shade of Medivh's father, found in the Guardian's Library. This is one of the most mechanics-heavy fights in Karazhan. Aran has NO THREAT TABLE - he attacks randomly. The key rule: during Flame Wreath, DO NOT MOVE.",
            "criticalRule": "DURING FLAME WREATH, DO NOT MOVE. Do not jump. Do not turn your character. Do not use Blink or Charge. Put pets on passive. Moving through ANY flame ring deals massive damage to the ENTIRE RAID and will likely cause a wipe.",
            "abilities": [
              {
                "name": "Flame Wreath",
                "spellId": 30004,
                "description": "Places rings of fire around 3 random players lasting 20 seconds. If ANYONE moves through ANY ring, it explodes for approximately 5,000 fire damage to the entire raid.",
                "handling": "STOP MOVING COMPLETELY when Flame Wreath is cast. Do not jump, do not turn, do not strafe, do not use movement abilities. Put pets on passive so they don't walk through rings. This is THE wipe mechanic - one person moving kills everyone."
              },
              {
                "name": "Blizzard",
                "spellId": 29969,
                "description": "A rotating Blizzard effect that circles around the room clockwise, dealing heavy frost damage and slowing anyone caught in it.",
                "handling": "Move WITH the rotation, staying ahead of the Blizzard. Don't panic - it follows a predictable clockwise pattern. Watch your feet and walk in the direction the Blizzard is moving."
              },
              {
                "name": "Arcane Explosion",
                "spellId": 29973,
                "description": "Aran magnetically pulls the entire raid to the center of the room, then begins a 10-second cast of Arcane Explosion dealing 10,000+ damage to anyone nearby.",
                "handling": "IMMEDIATELY run to the edge of the room when you get pulled to the center. Stand against the wall until the cast finishes. Getting caught in the middle means death."
              },
              {
                "name": "Mass Polymorph",
                "spellId": 29963,
                "description": "Polymorphs the entire raid into sheep while Aran drinks to restore mana.",
                "handling": "Wait for the Polymorph to wear off. When it ends, IMMEDIATELY interrupt Aran's Pyroblast with Counterspell, Kick, Shield Bash, or Earth Shock. If Pyroblast goes off, everyone takes 7,000 fire damage."
              },
              {
                "name": "Summon Water Elementals",
                "spellId": 37051,
                "description": "At 40% health, Aran summons 4 Water Elementals with 20,000 health each. They spam frost bolts at random targets.",
                "handling": "Burn down the Water Elementals with area-of-effect damage. Warlocks can Banish one. You cannot let them free-cast or the raid damage overwhelms healers."
              }
            ],
            "strategy": "Spread out around the room before pulling - there is no tank, Aran attacks randomly. During Flame Wreath: FREEZE. Do not move for any reason. During Blizzard: move clockwise with the rotation. During Arcane Explosion (pull to center): run to the walls immediately. After Mass Polymorph: interrupt the Pyroblast. At 40% health, burn down the Water Elementals quickly. IMPORTANT: Do not use mana consumables (mana potions, dark runes) while Aran is drinking or it may trigger extra Pyroblasts.",
            "commonMistakes": [
              "Moving during Flame Wreath (the most common wipe cause)",
              "Not running to the walls during Arcane Explosion",
              "Failing to interrupt Pyroblast after Mass Polymorph",
              "Using mana consumables while Aran is drinking",
              "Not killing Water Elementals quickly at 40%"
            ],
            "lootHighlights": [
              "Tirisfal Wand of Ascendancy",
              "Shermanar Great-Ring",
              "Aran's Soothing Sapphire"
            ]
          },
          {
            "name": "Netherspite",
            "npcId": 15689,
            "difficulty": "Hard",
            "description": "A nether dragon with a unique beam mechanic. Three colored beams connect portals to the boss - players must intercept these beams or the fight becomes impossible. The beams provide powerful buffs but also debuffs that stack over time.",
            "beamMechanics": {
              "red": {
                "name": "Perseverance (Red/Tank Beam)",
                "effect": "Reduces damage taken by 1% per stack. Increases damage dealt. BUT reduces maximum health by 1% per stack.",
                "handling": "Tanks intercept this beam. Swap tanks at 25-30 stacks before the health reduction becomes dangerous. Always have a tank in this beam."
              },
              "green": {
                "name": "Serenity (Green/Healer Beam)",
                "effect": "Restores 300 mana per second. Reduces healing done by 1% per stack. Increases healing received.",
                "handling": "Rotate 2-3 healers through this beam. Swap at 15-20 stacks before your healing becomes ineffective."
              },
              "blue": {
                "name": "Dominance (Blue/Damage Beam)",
                "effect": "Increases spell damage by 5% per stack. Reduces maximum health by 1% per stack.",
                "handling": "Casters (Warlocks, Mages, Shadow Priests) take this beam. Swap at 30+ stacks when health gets too low. Massive damage potential."
              }
            },
            "abilities": [
              {
                "name": "Void Zone",
                "spellId": 37063,
                "description": "Places purple void zones under random players dealing 1,000 shadow damage per second. Lasts 25 seconds.",
                "handling": "Move out immediately. Don't stand in the purple circles. Simple but deadly if ignored."
              },
              {
                "name": "Netherburn (Banish Phase)",
                "spellId": 30523,
                "description": "During the Banish Phase, Netherspite pulses 1,500 shadow damage every 2 seconds to the entire raid.",
                "handling": "Healers focus on area-of-effect healing. Stay spread for Void Zones. Wait for the beam phase to resume."
              }
            ],
            "strategy": "BEAM PHASE: Assign 2 tanks to rotate the red beam, 3 healers to rotate the green beam, and 2-3 casters to rotate the blue beam. Someone must ALWAYS be in each beam - if a beam hits the boss, bad things happen. Track your stacks and call for swaps at the designated thresholds. BANISH PHASE: Netherspite teleports to the center and becomes invulnerable. The raid spreads out, healers keep everyone alive through Netherburn damage. Beams reset. After Banish ends, immediately get back in position for beams. Repeat through 3-4 cycles until the boss dies.",
            "commonMistakes": [
              "Letting a beam hit the boss because no one was intercepting",
              "Staying in a beam too long and dying from stacked debuffs",
              "Not calling for beam swaps, causing confusion",
              "Standing in Void Zones",
              "Not spreading during Banish Phase"
            ],
            "lootHighlights": [
              "Spiteblade",
              "Cowl of Defiance",
              "Mantle of Abrahmis"
            ]
          },
          {
            "name": "Chess Event",
            "npcId": 17469,
            "difficulty": "Easy",
            "description": "A fun tactical minigame where players control chess pieces to defeat the enemy king. This is not a traditional boss fight. Each player possesses one chess piece and must use its abilities strategically.",
            "howToPlay": [
              "Click on a chess piece to possess it",
              "Each piece has unique abilities - read the tooltips",
              "Move your piece into attack range, then use abilities",
              "Move OUT when your piece takes damage to stay alive",
              "Medivh will occasionally 'cheat' by buffing enemy pieces or damaging yours"
            ],
            "pieceRoles": {
              "king": "Heals adjacent friendly pieces. Keep in the center and use the heal on cooldown.",
              "queen": "Highest damage. Position to attack the enemy king.",
              "bishops": "Heal friendly pieces from range.",
              "knights": "Can charge to enemy pieces.",
              "rooks": "Area-of-effect fire ability. Good against grouped enemies.",
              "pawns": "Basic attackers with cleave."
            },
            "strategy": "Have someone control the King (keep using heal), the Queen (focus the enemy king), and several other pieces. Move pieces into attack range and use their abilities. When your piece gets low, move it away to safety. Focus damage on the enemy King while protecting yours. If enemy healing pieces (clerics) are healing the king, kill them first. This fight is very forgiving - you can attempt it multiple times with no penalty.",
            "commonMistakes": [
              "Not moving pieces out when they're taking damage",
              "Ignoring the King's heal ability",
              "Not focusing damage on the enemy King"
            ],
            "lootHighlights": [
              "The chess chest contains guaranteed epic loot for the raid"
            ]
          },
          {
            "name": "Prince Malchezaar",
            "npcId": 15690,
            "difficulty": "Hard",
            "description": "The final boss of Karazhan, an eredar lord on the tower's rooftop. This three-phase fight features escalating damage and constant infernal spawns. Positioning is critical as the room fills up with fire over time.",
            "phaseBreakdown": [
              "Phase 1 (100% to 60%): Normal tanking. Enfeeble/Shadow Nova combo. Infernals spawn slowly.",
              "Phase 2 (60% to 30%): Prince equips two axes, tank damage increases dramatically. Sunder Armor stacks.",
              "Phase 3 (30% to 0%): Axes disappear. Infernals spawn faster. Increased damage to tank. BURN."
            ],
            "abilities": [
              {
                "name": "Enfeeble",
                "spellId": 30843,
                "description": "Reduces 5 random players (never the tank) to 1 health point for 7 seconds. Healing is reduced by 100% during this time. Health potions and Healthstones do NOT work.",
                "handling": "Enfeebled players must IMMEDIATELY run away from the boss, getting at least 30 yards away. Shadow Nova follows Enfeeble - if you're within range with 1 health, you die instantly."
              },
              {
                "name": "Shadow Nova",
                "spellId": 30852,
                "description": "A 3-second cast dealing approximately 3,000 shadow damage in a 30-yard radius. Always follows Enfeeble.",
                "handling": "If you are NOT enfeebled, stay in and continue damage/healing. If you ARE enfeebled, be outside 30 yards or you die. After Shadow Nova, enfeebled players return to normal health."
              },
              {
                "name": "Summon Infernal",
                "spellId": 30836,
                "description": "Infernals land at random locations and pulse fire damage (Hellfire) in a radius around them. They do NOT despawn for the entire fight. In Phase 3, they spawn more frequently.",
                "handling": "Tank the Prince in a corner of the room. As infernals land, the raid must kite around the edges of the room, avoiding the fire zones. Do not tank in the open center or you'll run out of room."
              },
              {
                "name": "Sunder Armor (Phase 2)",
                "spellId": 30901,
                "description": "Phase 2 only: Prince applies stacking armor reduction to the tank.",
                "handling": "Warriors can use Devastate to remove stacks. Alternatively, swap tanks at 3-5 stacks. This makes the tank very vulnerable if ignored."
              },
              {
                "name": "Thrash (Phase 2)",
                "spellId": 12787,
                "description": "Phase 2 only: Prince gains extra attacks, significantly increasing tank damage.",
                "handling": "Use tank defensive cooldowns during Phase 2. Shield Block and Dodge/Parry are very valuable here."
              },
              {
                "name": "Amplify Damage (Phase 3)",
                "spellId": 39095,
                "description": "Phase 3: Prince deals increased damage to the tank.",
                "handling": "Save major defensive cooldowns (Pain Suppression, Shield Wall, Last Stand) for Phase 3. This phase is a burn race."
              }
            ],
            "strategy": "POSITIONING: Tank Prince in a corner with your back to the wall. The raid positions between the tank and the center of the room. PHASE 1: Basic tanking. When Enfeeble hits, affected players run out beyond 30 yards. Everyone else continues damage. Move together as a group when infernals force repositioning. PHASE 2: The tank takes dramatically more damage. Use defensive cooldowns. Continue the Enfeeble dance. Warriors should manage Sunder stacks. PHASE 3: This is the burn phase. Infernals spawn rapidly, Prince hits hard. Pop Heroism/Bloodlust, all damage cooldowns, and kill him before the room fills with fire or the tank dies.",
            "commonMistakes": [
              "Enfeebled players not running out, dying to Shadow Nova",
              "Tanking in the middle of the room and running out of space from infernals",
              "Not using tank cooldowns in Phase 2, tank dying",
              "Not saving damage cooldowns for the Phase 3 burn",
              "Raid standing near infernals and taking unnecessary fire damage"
            ],
            "lootHighlights": [
              "Tier 4 Helm token",
              "Gorehowl",
              "Light's Justice",
              "Stainless Cloak of the Pure Hearted"
            ]
          },
          {
            "name": "Nightbane (Optional Boss)",
            "npcId": 17225,
            "difficulty": "Hard",
            "description": "An optional undead dragon boss on the Master's Terrace (the balcony). Nightbane must be summoned using the Blackened Urn, obtained through a questline starting with Medivh's Journal. This is a long, healing-intensive fight alternating between ground and air phases.",
            "attunement": "Complete the Medivh's Journal questline, which involves collecting items from various Karazhan bosses, to receive the Blackened Urn. Use the urn on the Master's Terrace to summon Nightbane.",
            "abilities": [
              {
                "name": "Bellowing Roar",
                "spellId": 36922,
                "description": "A 2.5-second cast area-of-effect fear during ground phases.",
                "handling": "Priests should Fear Ward the tank. Shamans use Tremor Totem. Warriors use Berserker Rage. Tank with your back to a wall so fear doesn't knock you off the balcony."
              },
              {
                "name": "Charred Earth",
                "spellId": 30129,
                "description": "Fire patches appear under random players, dealing 1,500 fire damage per second. These last 60 seconds.",
                "handling": "Move out of fire immediately. The ground gets crowded - kite Nightbane to clear areas if needed. Watch your feet constantly."
              },
              {
                "name": "Smoldering Breath",
                "spellId": 30210,
                "description": "Frontal cone fire breath dealing 4,000-6,000 damage plus a damage-over-time effect.",
                "handling": "Tank faces the boss away from the raid. Only the tank should be hit by this."
              },
              {
                "name": "Tail Sweep",
                "spellId": 25653,
                "description": "A rear cone knockback affecting anyone behind the boss.",
                "handling": "Melee stand at the boss's SIDE, not behind. Getting knocked off the balcony is fatal."
              },
              {
                "name": "Smoking Blast (Air Phase)",
                "spellId": 37057,
                "description": "During air phases, Nightbane targets the highest threat (usually the tank) with stacking fire damage-over-time. Each stack increases the damage.",
                "handling": "The tank MUST survive the air phase. Use defensive cooldowns, health potions, Healthstones. Healers spam the tank. At 4+ stacks, damage becomes dangerous."
              },
              {
                "name": "Rain of Bones (Air Phase)",
                "spellId": 37091,
                "description": "Targets a random player with an area-of-effect zone. Spawns 5 Restless Skeleton adds (13,000 health each) where it lands.",
                "handling": "THE ENTIRE RAID STACKS ON THE TANK during air phases. This causes all skeletons to spawn in one spot for easy area-of-effect damage. Kill all skeletons before Nightbane lands or they overwhelm the raid."
              }
            ],
            "strategy": "GROUND PHASES (100%-75%, 50%-25%): Tank against a wall to prevent fear knockback. Face the boss away from the raid. Move out of Charred Earth. Fear Ward the tank. At 75%, 50%, and 25% health, Nightbane takes flight. AIR PHASES: The raid stacks on the tank's position. Kill the Restless Skeletons with area-of-effect damage immediately. Healers spam the tank to keep them alive through Smoking Blast stacks. When Nightbane lands, the tank picks him up immediately. This fight is LONG - conserve mana and expect it to take 8-10 minutes.",
            "commonMistakes": [
              "Tank getting feared off the balcony because they weren't against a wall",
              "Standing in Charred Earth fire patches",
              "Not stacking during air phase, causing skeletons to spawn in multiple locations",
              "Tank dying during air phase from Smoking Blast stacks",
              "Not killing skeletons before Nightbane lands"
            ],
            "lootHighlights": [
              "Nightstaff of the Everliving",
              "Shield of Impenetrable Darkness",
              "Stonebough Jerkin"
            ]
          }
        ]
      },
      "gruuls_lair": {
        "name": "Gruul's Lair",
        "shortName": "Gruul",
        "size": 25,
        "location": "Blade's Edge Mountains",
        "attunement": "None required",
        "description": "A short two-boss raid featuring ogre lords. This is often your guild's first 25-player raid. High King Maulgar is a challenging coordination fight, while Gruul himself is a damage race with unique Shatter mechanics.",
        "recommendedComposition": {
          "tanks": "3-4 (Maulgar requires multiple tanks)",
          "healers": "6-7",
          "dps": "14-16",
          "notes": "Maulgar REQUIRES a Mage to tank Krosh Firehand. Bring Hunters for kiting Kiggler. Priests are valuable for Shackle if needed."
        },
        "minimumGear": {
          "tanks": "14,000+ health unbuffed, 490 Defense, full Karazhan gear recommended",
          "healers": "1,200+ healing power, 9,000+ mana",
          "dps": "Karazhan gear or equivalent"
        },
        "tierTokens": "Tier 4 Legs and Shoulders tokens drop here",
        "bosses": [
          {
            "name": "High King Maulgar",
            "npcId": 18831,
            "difficulty": "Hard (Coordination)",
            "description": "A council-style fight against King Maulgar and his four ogre advisors. Each advisor has unique mechanics requiring different tanks and strategies. This fight tests your raid's ability to coordinate multiple targets simultaneously.",
            "councilMembers": [
              {
                "name": "Krosh Firehand (Mage)",
                "role": "Must be MAGE TANKED. A Mage spellsteals his Spell Shield and tanks him at range.",
                "danger": "Will Blast Wave anyone in melee range, causing massive damage."
              },
              {
                "name": "Olm the Summoner (Warlock)",
                "role": "Off-tanked away from casters. Summons Felhunters that mana burn.",
                "danger": "Death Coil fears the tank. Felhunters destroy caster mana."
              },
              {
                "name": "Kiggler the Crazed (Shaman)",
                "role": "HUNTER KITED. Cannot be melee tanked - he polymorphs melee attackers.",
                "danger": "Lightning Bolts hurt. Must be kited continuously."
              },
              {
                "name": "Blindeye the Seer (Priest)",
                "role": "Off-tanked. His Prayer of Healing heals ALL council members.",
                "danger": "MUST DIE FIRST or the fight becomes impossible due to healing."
              }
            ],
            "abilities": [
              {
                "name": "Arcing Smash",
                "spellId": 39144,
                "description": "Maulgar's frontal cone dealing 7,000-8,000 physical damage.",
                "handling": "Tank Maulgar facing away from the raid. Only the main tank should be in front of him."
              },
              {
                "name": "Mighty Blow",
                "spellId": 33230,
                "description": "Knockback on Maulgar's current target.",
                "handling": "Tank with your back to a wall to avoid positioning problems."
              },
              {
                "name": "Whirlwind",
                "spellId": 33238,
                "description": "Maulgar spins, dealing massive damage to anyone in melee range for 8 seconds.",
                "handling": "ALL MELEE RUN OUT immediately when Whirlwind starts. Return when it ends."
              },
              {
                "name": "Berserker Charge (50% HP)",
                "spellId": 26561,
                "description": "At 50% health, Maulgar gains Berserker Charge, randomly charging raid members.",
                "handling": "This is why you kill all adds before focusing Maulgar. Stay spread loosely."
              }
            ],
            "strategy": "PULL ASSIGNMENTS: Main Tank grabs Maulgar (tank against wall). Off-Tank 1 grabs Olm (tank away from casters). Mage tanks Krosh (Spellsteal his shield!). Hunter kites Kiggler (never stop moving). Off-Tank 2 grabs Blindeye. KILL ORDER: Blindeye first (interrupt his heals!), then Olm, then Kiggler (Hunter keeps kiting until it's his turn), then Krosh (Mage keeps tanking until it's his turn), and finally Maulgar. At 50% Maulgar health, he begins charging randomly - burn him down.",
            "commonMistakes": [
              "Mage dying because they didn't Spellsteal Krosh's shield",
              "Not interrupting Blindeye's heals, making the fight take forever",
              "Melee not running from Maulgar's Whirlwind",
              "Kiggler killing people because the Hunter stopped kiting",
              "Not having the correct number of tanks assigned"
            ],
            "lootHighlights": [
              "Tier 4 Shoulders token",
              "Malefic Mask of the Shadows",
              "Hammer of the Naaru"
            ]
          },
          {
            "name": "Gruul the Dragonkiller",
            "npcId": 19044,
            "difficulty": "Hard (DPS Race)",
            "description": "A massive gronn in a circular arena. Gruul grows stronger every 30 seconds, making this a race against time. The unique Shatter mechanic requires the raid to spread out after being slowed and turned to stone.",
            "keyMechanic": "Growth: Every 30 seconds, Gruul gains 15% increased damage. This stacks up to 30 times. You MUST kill him before stacks get too high or the tank cannot survive.",
            "abilities": [
              {
                "name": "Growth",
                "spellId": 36300,
                "description": "Every 30 seconds, Gruul gains 15% increased damage permanently. Stacks up to 30 times (450% total increase).",
                "handling": "This is the soft enrage timer. You must kill Gruul before 8-10 stacks or tank deaths become unavoidable. Use damage cooldowns EARLY, not late - the fight gets harder over time."
              },
              {
                "name": "Ground Slam",
                "spellId": 33525,
                "description": "Knocks back the entire raid and applies Gronn Lord's Grasp, a stacking slow that eventually roots everyone in stone.",
                "handling": "After the knockback, you have approximately 5 seconds before you turn to stone. SPREAD OUT as much as possible during this time."
              },
              {
                "name": "Shatter",
                "spellId": 33654,
                "description": "After everyone turns to stone, Gruul shatters the effect. Damage is based on PROXIMITY to other players: 0-5 yards = 8,000-9,000 damage, 6-10 yards = 4,000-5,000 damage, 11-15 yards = 2,000 damage, 16+ yards = no damage.",
                "handling": "BE SPREAD OUT when you turn to stone. Minimum 15 yards apart from everyone else. THIS IS THE MAIN WIPE MECHANIC. Divine Shield and Ice Block prevent turning to stone but NOT Shatter damage."
              },
              {
                "name": "Hurtful Strike",
                "spellId": 33813,
                "description": "Every 8 seconds, Gruul hits the raid member with the highest health in melee range (excluding the main tank) for 12,000+ physical damage.",
                "handling": "You MUST have an off-tank in melee range to soak these hits. The off-tank should be second on threat. If no off-tank is present, a damage dealer will die."
              },
              {
                "name": "Reverberation",
                "spellId": 36297,
                "description": "4-second area-of-effect silence.",
                "handling": "Healers should pre-apply heal-over-time effects. Not hugely threatening but can be annoying during critical moments."
              },
              {
                "name": "Cave In",
                "spellId": 36240,
                "description": "Rocks fall at random locations, dealing 3,000 physical damage per second to anyone standing in them.",
                "handling": "Move out of the dusty ground circles. Simple but deadly if you're rooted in stone inside one."
              }
            ],
            "strategy": "POSITIONING: Spread around the room edges. Main tank and off-tank stay in the center. The off-tank must be in melee range to soak Hurtful Strikes. GROUND SLAM SEQUENCE: When Ground Slam hits, use any movement abilities to spread even further. You have 5 seconds before turning to stone. After Shatter, regroup (loosely) and continue damage. POP COOLDOWNS EARLY: Use Heroism/Bloodlust and damage trinkets in the first 2-3 minutes. Growth makes the fight exponentially harder, so front-load your damage. This is a DPS race - you have approximately 4-5 minutes before Growth overwhelms healing.",
            "commonMistakes": [
              "Not spreading for Shatter, causing massive raid damage",
              "Not having an off-tank to soak Hurtful Strike",
              "Saving damage cooldowns too long - use them early",
              "Standing in Cave In rocks while rooted",
              "Tank dying because Growth stacks got too high"
            ],
            "lootHighlights": [
              "Tier 4 Legs token",
              "Dragonspine Trophy",
              "Gronn-Stitched Girdle",
              "Axe of the Gronn Lords"
            ]
          }
        ]
      },
      "magtheridons_lair": {
        "name": "Magtheridon's Lair",
        "shortName": "Mag",
        "size": 25,
        "location": "Hellfire Peninsula (beneath Hellfire Citadel)",
        "attunement": "None required",
        "description": "A single-boss raid featuring the pit lord Magtheridon, imprisoned beneath Hellfire Citadel. This fight requires precise coordination with 5 players clicking cubes simultaneously to interrupt a devastating ability.",
        "recommendedComposition": {
          "tanks": "3-4 (one for Magtheridon, 2-3 for Channelers)",
          "healers": "6-7",
          "dps": "14-16",
          "notes": "Designate 5 reliable players as 'cube clickers' BEFORE the fight. These players must click Manticron Cubes simultaneously."
        },
        "minimumGear": {
          "tanks": "14,000+ health, Karazhan gear",
          "healers": "1,200+ healing power",
          "dps": "Karazhan gear or equivalent"
        },
        "tierTokens": "Tier 4 Chest token drops here",
        "bosses": [
          {
            "name": "Magtheridon",
            "npcId": 17257,
            "difficulty": "Hard (Coordination)",
            "description": "A pit lord imprisoned by 5 Hellfire Channelers. The fight has two phases: killing the Channelers while Magtheridon is banished, then fighting Magtheridon while coordinating cube clicks to interrupt his Blast Nova.",
            "phaseBreakdown": [
              "Phase 1 (Channelers): Kill all 5 Hellfire Channelers while Magtheridon is banished. Interrupt their heals. Handle Burning Abyssal adds.",
              "Phase 2 (Magtheridon): Tank Magtheridon. 5 designated players must click Manticron Cubes simultaneously to interrupt Blast Nova. At 30%, the ceiling collapses."
            ],
            "cubeClickMechanic": "5 Manticron Cubes are positioned around the room. When Magtheridon casts Blast Nova (a 20-second cast), 5 designated players must click their assigned cubes within 1 second of each other. This banishes Magtheridon and interrupts the cast. Missing the click means half the raid dies.",
            "abilities": [
              {
                "name": "Blast Nova",
                "spellId": 30616,
                "description": "A 20-second cast that deals 50% of every player's maximum health as fire damage. Cast repeatedly during Phase 2.",
                "handling": "5 DESIGNATED CLICKERS must click Manticron Cubes simultaneously to banish Magtheridon and interrupt this cast. Use voice communication with a countdown: '5-4-3-2-1-CLICK'. Missing this is catastrophic."
              },
              {
                "name": "Cleave",
                "spellId": 30619,
                "description": "Frontal cleave dealing 7,000-10,000 physical damage.",
                "handling": "Tank faces Magtheridon away from the raid. Only the tank should be in front."
              },
              {
                "name": "Quake",
                "spellId": 30657,
                "description": "Raid-wide knockback and spell interruption every 40 seconds.",
                "handling": "Casters should stop casting during Quake. Brief interruption - resume immediately after."
              },
              {
                "name": "Cave In (30% HP)",
                "spellId": 36240,
                "description": "At 30% health, the ceiling collapses. The entire raid takes 5,000-8,000 physical damage every 2 seconds for the rest of the fight.",
                "handling": "THIS IS THE BURN PHASE. Pop all remaining cooldowns. Heroism/Bloodlust if not used. Healers spam area-of-effect heals. You must kill Magtheridon quickly or healers run out of mana."
              },
              {
                "name": "Channeler Shadow Bolt Volley",
                "spellId": 30510,
                "description": "Phase 1: Channelers cast shadow bolts at random targets.",
                "handling": "Kill Channelers quickly. Assign a kill order."
              },
              {
                "name": "Channeler Dark Mending",
                "spellId": 30528,
                "description": "Phase 1: Channelers heal each other for significant amounts.",
                "handling": "INTERRUPT with Kick, Pummel, Earth Shock, Shield Bash. If they heal, Phase 1 takes forever."
              },
              {
                "name": "Burning Abyssal (Phase 1)",
                "spellId": 30511,
                "description": "Channelers periodically spawn fire elemental adds.",
                "handling": "Off-tank picks up Abyssals. Kill them after Channelers die or they accumulate and overwhelm."
              }
            ],
            "strategy": "PHASE 1: Pull all 5 Channelers to the center. Assign 2-3 tanks to hold them. Assign an interrupt rotation for Dark Mending heals. DPS burns them down while an off-tank handles Burning Abyssal adds. This phase should take about 2 minutes. PHASE 2: When Magtheridon becomes active, your main tank picks him up and faces him away. 5 DESIGNATED CLICKERS position at their assigned cubes. When Blast Nova starts casting, the raid leader counts down: '5-4-3-2-1-CLICK'. All 5 clickers click simultaneously. Repeat for every Blast Nova. AT 30%: Ceiling collapses. BURN. Pop everything. Kill him before healers go out of mana.",
            "commonMistakes": [
              "Cube clickers not clicking simultaneously, failing to interrupt Blast Nova",
              "Not interrupting Channeler heals in Phase 1",
              "Tank dying at 30% because healers can't keep up with Cave In damage",
              "Abyssal adds overwhelming the raid in Phase 1",
              "Cube clickers dying before Phase 2 - protect them!"
            ],
            "lootHighlights": [
              "Tier 4 Chest token",
              "Pit Lord's Satchel (20-slot bag)",
              "Crystalheart Pulse-Staff",
              "Eye of Magtheridon"
            ]
          }
        ]
      }
    }
  },
  "phase2": {
    "name": "Phase 2: Tier 5 Content",
    "description": "The second raiding tier introduces Serpentshrine Cavern and Tempest Keep: The Eye. These raids are significantly more challenging than Tier 4 and drop Tier 5 armor tokens.",
    "raids": {
      "serpentshrine_cavern": {
        "name": "Serpentshrine Cavern",
        "shortName": "SSC",
        "size": 25,
        "location": "Coilfang Reservoir, Zangarmarsh",
        "attunement": "The Cudgel of Kar'desh (requires killing Nightbane in Karazhan and Gruul)",
        "description": "Lady Vashj's underwater stronghold beneath Zangarmarsh. This 25-player raid features 6 challenging bosses and introduces many complex mechanics that will test raid coordination. Heavy resistance gear is required for multiple encounters. Most guilds spend 2-3 months progressing through this instance.",
        "recommendedComposition": {
          "tanks": 4,
          "healers": 7,
          "dps": 14,
          "notes": "Bring 2 Frost Resist tanks and 2 Nature Resist tanks for Hydross. A Warlock tank is mandatory for Leotheras. Multiple Mages help with add control on Vashj. Shamans are valuable for Heroism/Bloodlust timing."
        },
        "minimumGear": {
          "tanks": "15,000+ health unbuffed, resistance sets for Hydross (365 Frost/Nature buffed)",
          "healers": "1,400+ healing power, 9,000+ mana",
          "dps": "Full Tier 4 or equivalent recommended"
        },
        "tierTokens": "Tier 5 Gloves, Helm, and Legs tokens drop here",
        "bosses": [
          {
            "name": "Hydross the Unstable",
            "npcId": 21216,
            "difficulty": "Medium",
            "description": "A water elemental that alternates between Frost and Nature forms based on position. Crossing the threshold (marked by banners) triggers a form change and spawns 4 elemental adds. This fight is entirely about controlled transitions and proper resistance gear - DPS is secondary to execution.",
            "phaseBreakdown": [
              "Frost Form: Hydross deals Frost damage and applies Mark of Hydross. Tank requires 365 Frost resistance (332 gear + buffs). Water Tomb stuns random players.",
              "Nature Form: Hydross deals Nature damage and applies Mark of Corruption. Tank requires 365 Nature resistance. Vile Sludge reduces healing by 50%.",
              "Transition: Crossing threshold spawns 4 Pure Spawn adds dealing 4-5k damage each. Aggro resets completely on Hydross."
            ],
            "abilities": [
              {
                "name": "Mark of Hydross",
                "spellId": 38215,
                "description": "Applies every 15 seconds in Frost form. Each stack increases Frost damage taken by 10%. After 4 stacks, even resistance-geared tanks take massive damage.",
                "handling": "Transition to Nature form before reaching 5-6 stacks. Stop all DPS at 3-4 stacks to prepare for transition. DoT classes must be especially careful."
              },
              {
                "name": "Mark of Corruption",
                "spellId": 38219,
                "description": "Applies every 15 seconds in Nature form. Each stack increases Nature damage taken by 10%. Generally less threatening than Frost marks.",
                "handling": "Same as Mark of Hydross - transition around 4-5 stacks. Nature phase is considered slightly easier."
              },
              {
                "name": "Water Tomb",
                "spellId": 38235,
                "description": "Encases a random player and nearby allies in a water tomb, stunning them for 5 seconds and dealing 900 Frost damage per second (4,500 total).",
                "handling": "Spread out at least 6 yards to prevent chain-tombing. Healers must immediately heal tombed players - they'll drop to 50% health or lower."
              },
              {
                "name": "Vile Sludge",
                "spellId": 38246,
                "description": "Coats a target in sludge, reducing damage and healing done by 50% and dealing 500 Nature damage every 3 seconds for 24 seconds.",
                "handling": "Dispel immediately if on a healer or tank. Magic dispel only. If on DPS, can wait for a GCD but don't delay too long."
              },
              {
                "name": "Purify Elemental",
                "spellId": 36461,
                "description": "Clears all threat when transitioning between forms. Hydross will attack whoever is closest after transition.",
                "handling": "The new resistance tank must be in position and ready to immediately generate threat. All DPS must stop completely during transition."
              }
            ],
            "strategy": "Position Hydross at the threshold (marked by banners on the floor). Frost resist tank pulls and tanks in clean water. At 4-5 stacks, all DPS stops and the Nature resist tank taunts Hydross across the threshold. Four adds spawn - off-tanks pick them up and raid AoEs them down quickly while staying on boss. Repeat this cycle, alternating forms every 4-5 marks. The fight is won by clean transitions with minimal raid damage. Enrage timer is 10 minutes - DPS is not the issue, execution is.",
            "commonMistakes": [
              "Tanks not having enough resistance (365 buffed required)",
              "DPS not stopping before transitions, pulling Hydross across accidentally with DoTs",
              "Raid members standing too close and getting chain-tombed",
              "Not dispelling Vile Sludge on tanks",
              "Adds running loose during transition and killing healers"
            ],
            "lootHighlights": [
              "Hydross's Ring of Chaos",
              "Scarab of Displacement",
              "Wraps of Purification"
            ]
          },
          {
            "name": "The Lurker Below",
            "npcId": 21217,
            "difficulty": "Medium",
            "description": "A colossal fish lurking beneath Serpentshrine Cavern's central pool. The Lurker must be fished up using 300+ fishing skill. The fight takes place on platforms surrounding a large pool - positioning and the Spout mechanic define this encounter. Learning to recognize and react to Spout is the key skill.",
            "phaseBreakdown": [
              "Phase 1 (Active): Lurker is targetable. Tank in pool, raid on platforms. Avoid Spout by submerging. Watch for Whirl and Geyser.",
              "Phase 2 (Submerge): At 2 minutes, Lurker submerges. Adds spawn on platforms - 2 Guardians (tanked) and 6 Ambushers (killed fast). Get out of water!",
              "Repeat: Lurker resurfaces, repeat Phase 1. This cycle continues until boss dies."
            ],
            "abilities": [
              {
                "name": "Spout",
                "spellId": 37433,
                "description": "The Lurker rotates 360 degrees while spewing a water jet. Anyone caught takes 4,500 Frost damage and is knocked back 100 yards (into the cavern walls = death). The rotation takes about 25 seconds to complete.",
                "handling": "JUMP INTO THE WATER and SUBMERGE (swim down) when Spout starts. Stay underwater until the beam passes your position. You'll see the boss slowly rotating - only surface when the beam has gone past. Timing is everything. Watch for Lurker to stop attacking and rear back - this signals Spout is coming."
              },
              {
                "name": "Whirl",
                "spellId": 37363,
                "description": "Knocks back all players within 15 yards, dealing 3,000-4,000 Physical damage and reducing threat by 50%. Used frequently during Phase 1.",
                "handling": "Melee must constantly reposition after Whirl. Threat can be tricky - tanks should use high-threat abilities after each Whirl. Ranged should stay at max range to avoid being knocked into the water."
              },
              {
                "name": "Geyser",
                "spellId": 37478,
                "description": "Targets a random player and erupts a water geyser beneath them after 2 seconds, dealing 3,500-4,500 Frost damage to anyone within 10 yards and launching them into the air.",
                "handling": "Spread out on platforms - at least 10 yards apart. When you see the geyser animation under you or nearby, move away immediately. If launched into air, try to land on a platform, not in the water during adds phase."
              },
              {
                "name": "Water Bolt",
                "spellId": 37138,
                "description": "Ranged attack dealing 5,500-6,500 Frost damage to a random target when no one is in melee range.",
                "handling": "Keep the tank in melee range at all times. If the tank gets knocked back by Whirl, they must immediately swim back. Water Bolt spam will quickly kill healers and ranged."
              },
              {
                "name": "Scalding Water",
                "spellId": 37284,
                "description": "The pool water deals 500 Fire damage per second to anyone swimming in it. During Submerge phase, the damage increases significantly.",
                "handling": "Only enter water to avoid Spout, then get out immediately. During Submerge phase, DO NOT BE IN THE WATER - the damage ramps up and you will die. Get onto platforms before Lurker submerges."
              },
              {
                "name": "Coilfang Guardian (Add)",
                "spellId": 0,
                "description": "Two Naga melee adds spawn on the inner platforms during Submerge. They hit hard and have significant health.",
                "handling": "Tanks must be on platforms ready to pick these up. They can be crowd controlled (Polymorph, Hibernate) while DPS focuses on Ambushers first. Kill after Ambushers die."
              },
              {
                "name": "Coilfang Ambusher (Add)",
                "spellId": 0,
                "description": "Six archer adds spawn on the outer platforms during Submerge. They Multi-Shot and deal moderate ranged damage.",
                "handling": "KILL THESE FIRST. They have low health but their combined damage is dangerous. Ranged DPS should prioritize these immediately. Warlocks can Fear, Mages can Frost Nova. Get them down fast."
              }
            ],
            "strategy": "SETUP: Position tanks in the water near the boss, melee on the closest platform edge, ranged spread across other platforms. Assign tanks to specific platforms for add pickup. PHASE 1: Tank and spank. When Lurker rears back for Spout, EVERYONE jumps into water and submerges - surface only after beam passes. Tank swims back quickly after Whirl. SUBMERGE: Get out of the water immediately! Tanks pick up Guardians on inner platforms. DPS burns all 6 Ambushers first, then kills Guardians. When Lurker resurfaces, tank gets back in water, repeat. ENRAGE: 10 minutes. With good execution, you'll kill him in 6-7 minutes.",
            "commonMistakes": [
              "Not recognizing the Spout wind-up animation and getting knocked off the platforms",
              "Staying in the water during Submerge phase and dying to Scalding Water",
              "Not spreading on platforms, causing Geyser to hit multiple people",
              "Tank not getting back to melee range after Whirl, causing Water Bolt spam",
              "Killing Guardians before Ambushers, letting ranged add damage stack up"
            ],
            "lootHighlights": [
              "Glowing Breastplate of Truth",
              "Earring of Soulful Meditation",
              "Mallet of the Tides",
              "Cord of Screaming Terrors"
            ]
          },
          {
            "name": "Leotheras the Blind",
            "npcId": 21215,
            "difficulty": "Hard",
            "description": "A Blood Elf demon hunter imprisoned by Lady Vashj, Leotheras channels Illidan's dual nature - shifting between his Blood Elf form and a fearsome Demon form. This fight requires a Warlock tank (non-negotiable) and tests every raid member's ability to defeat their own Inner Demon. One of the most mechanically demanding fights in SSC.",
            "phaseBreakdown": [
              "Phase 1 (Blood Elf - 100% to 60%): Leotheras in humanoid form. Tank faces away, melee watch for Whirlwind. Cycles between Blood Elf and Demon forms.",
              "Phase 2 (Demon - 60 seconds each cycle): Demon form ignores normal threat - Warlock tank required. Inner Demons spawn for random players.",
              "Phase 3 (Split - 15% HP): BOTH forms exist simultaneously. Blood Elf and Demon must both be tanked. Burn phase - pop cooldowns."
            ],
            "warlockTankRequirements": {
              "gear": "285+ Shadow Resistance, 10,000+ HP buffed, 200+ spell damage minimum",
              "talents": "Soul Link and Demonic Sacrifice essential",
              "consumables": "Shadow Protection Potion, Healthstones, Master Healthstone",
              "rotation": "Searing Pain spam for threat. Life Tap as needed but carefully."
            },
            "abilities": [
              {
                "name": "Whirlwind",
                "spellId": 37640,
                "description": "In Blood Elf form, Leotheras spins in place for 12 seconds, dealing 3,000-5,000 Physical damage per second to anyone within 10 yards. He does NOT move during this - but the damage is lethal.",
                "handling": "When Whirlwind starts (you'll see him spin), ALL melee and tanks RUN OUT immediately. Stay at 15+ yards until it ends. Ranged and healers continue as normal. After Whirlwind, tank re-engages and faces him away from raid."
              },
              {
                "name": "Chaos Blast",
                "spellId": 37674,
                "description": "In Demon form, blasts the highest threat target for 1,500-2,500 Fire damage. Cast every 2 seconds. Applies a debuff increasing Fire damage taken by 1,675 for 45 seconds. Stacks.",
                "handling": "WARLOCK TANK takes all Chaos Blasts. With Shadow/Fire resistance gear, the damage is manageable. Healers must keep the Warlock alive - assign 2-3 healers specifically. If anyone pulls aggro from the Warlock, they die instantly."
              },
              {
                "name": "Demon Form Transition",
                "spellId": 37673,
                "description": "Every 60 seconds, Leotheras transforms into Demon form for 60 seconds, then returns to Blood Elf form. Threat is separate between forms.",
                "handling": "Warlock must be ready to immediately grab threat when Demon form activates. The Warlock should pre-cast Searing Pain to land right as he transforms. Warrior tank holds threat in Blood Elf form and steps back during Demon phases."
              },
              {
                "name": "Inner Demon",
                "spellId": 37676,
                "description": "During Demon form, 5 random raid members spawn a personal Inner Demon. ONLY YOU can damage YOUR Inner Demon. If you don't kill it within 30 seconds, you become permanently Mind Controlled for the rest of the fight.",
                "handling": "DROP EVERYTHING and kill your Inner Demon immediately. It has approximately 6,000 HP. Melee classes should have no issue. Healers and casters need instant casts and wands. If you get MC'd, you will likely wipe the raid. Practice this - it's the #1 wipe mechanic."
              },
              {
                "name": "Insidious Whisper",
                "spellId": 37676,
                "description": "The debuff that spawns your Inner Demon. Cannot be dispelled. You have 30 seconds.",
                "handling": "You'll see a demon spawn near you with YOUR class icon. Target it immediately. Healers: use instant heals on yourself and wand. Shadow Priests can dot. Every class can kill their demon if they react fast."
              },
              {
                "name": "Clear Aggro",
                "spellId": 0,
                "description": "When transitioning between Blood Elf and Demon forms, threat resets completely.",
                "handling": "Both tanks must be ready to establish threat quickly. The Warrior during Blood Elf form, the Warlock during Demon form. DPS should hold back for 2-3 seconds after each transition."
              }
            ],
            "strategy": "POSITIONING: Tank Leotheras in the center of his pool area, facing away from raid. Melee stack behind him. Ranged spread loosely at max range. Warlock tank stands at range until Demon phase. BLOOD ELF PHASE: Standard tanking. When Whirlwind starts, melee RUN OUT, ranged continue DPS. DEMON PHASE: Warlock immediately taunts and spams Searing Pain. Healers focus the Warlock. When Inner Demons spawn, EVERYONE kills their own demon - this is not optional. PHASE 3 (15%): Both forms exist at once! Warrior tanks Blood Elf, Warlock tanks Demon. Pop Heroism/Bloodlust and all cooldowns. Burn him before the chaos becomes unmanageable.",
            "commonMistakes": [
              "Melee not running from Whirlwind and dying in seconds",
              "Warlock tank not pre-casting Searing Pain and losing threat on Demon phase",
              "Raid members not killing their Inner Demon in time and getting MC'd",
              "Healers tunnel-visioning on tanks and dying to their own Inner Demon",
              "Not having a properly geared Warlock tank - this fight REQUIRES one"
            ],
            "lootHighlights": [
              "Gloves of the Vanquished Champion/Defender/Hero",
              "True-Aim Stalker Bands",
              "Girdle of the Invulnerable",
              "Tsunami Talisman"
            ]
          },
          {
            "name": "Fathom-Lord Karathress",
            "npcId": 21214,
            "difficulty": "Hard",
            "description": "A council-style encounter where Fathom-Lord Karathress is joined by three powerful advisors. Each advisor killed transfers their abilities to Karathress, making the kill order critical. This fight demands excellent coordination between multiple tanks and a solid understanding of each advisor's mechanics. Proper interrupt rotations are mandatory.",
            "phaseBreakdown": [
              "Phase 1 (All Alive): Tank all 4 enemies separately. Focus DPS on advisors in kill order. Karathress stays in his starting position.",
              "Phase 2 (1 Advisor Dead): Karathress gains first ability. Continue kill order.",
              "Phase 3 (2 Advisors Dead): Karathress gains second ability. Damage ramps up.",
              "Phase 4 (Karathress Only): All three abilities active on Karathress. Burn phase with Heroism/Bloodlust."
            ],
            "advisors": [
              {
                "name": "Fathom-Guard Caribdis",
                "role": "Healer (KILL FIRST)",
                "abilities": [
                  "Healing Wave: 3-second cast healing an ally for 30,000-50,000. MUST BE INTERRUPTED every time.",
                  "Water Bolt Volley: AoE Frost damage to the raid. Interruptible but lower priority than heals.",
                  "Tidal Surge: Buffs an ally with attack speed. Dispel with Purge/Dispel Magic."
                ],
                "tankStrategy": "Can be tanked by anyone since she's a caster. Face away from raid. Assign 2-3 interrupters with a rotation to stop every Healing Wave."
              },
              {
                "name": "Fathom-Guard Tidalvess",
                "role": "Shaman (Kill Second)",
                "abilities": [
                  "Spitfire Totem: Places a totem that shoots fireballs. Kill totem immediately.",
                  "Frost Shock: Instant Frost damage and slow on current target.",
                  "Windfury: Melee attacks have chance for extra attacks. Makes him dangerous to tanks."
                ],
                "tankStrategy": "Requires a geared tank. Kill his Spitfire Totems instantly - they deal significant raid damage. Can be tanked near Karathress but keep some distance."
              },
              {
                "name": "Fathom-Guard Sharkkis",
                "role": "Hunter (Kill Third)",
                "abilities": [
                  "Multi-Shot: AoE physical damage to multiple targets in front.",
                  "Leeching Throw: Drains health and transfers it to Sharkkis.",
                  "The Beast Below: Summons a pet shark that needs to be kited or offtanked."
                ],
                "tankStrategy": "Kite-tank the pet shark with a Frost Mage or Hunter. Main tank handles Sharkkis. Keep raid spread to minimize Multi-Shot damage."
              }
            ],
            "abilities": [
              {
                "name": "Cataclysmic Bolt",
                "spellId": 38441,
                "description": "Karathress's core ability. Deals damage equal to 50% of the target's maximum health as Nature damage. Used on his current target (usually the tank).",
                "handling": "Cannot be resisted, avoided, or mitigated. Healers MUST keep the Karathress tank at 60%+ health at ALL times. If tank is at 50% when this hits, they die. Assign dedicated healers to this tank."
              },
              {
                "name": "Enrage",
                "spellId": 38947,
                "description": "At 25% HP, Karathress enrages, increasing damage dealt by 50%.",
                "handling": "Save Heroism/Bloodlust for this phase. Burn him down. Tank cooldowns and heavy healing required."
              },
              {
                "name": "Sear Nova (from Caribdis)",
                "spellId": 38445,
                "description": "After Caribdis dies, Karathress gains this ability. AoE Fire damage to everyone within 20 yards.",
                "handling": "Melee stay at max melee range. Pre-heal before each Nova. Paladins can use Fire Resistance Aura."
              },
              {
                "name": "Tidal Surge (from Tidalvess)",
                "spellId": 38358,
                "description": "After Tidalvess dies, Karathress gains this ability. Frost damage and knockback to the tank plus nearby players.",
                "handling": "Tank Karathress against a wall to prevent knockback into the raid. Melee should not stack directly behind the tank."
              },
              {
                "name": "Beast Within (from Sharkkis)",
                "spellId": 38373,
                "description": "After Sharkkis dies, Karathress summons his own pet and gains increased attack speed.",
                "handling": "Off-tank picks up the pet. It doesn't hit hard but adds cleave danger. Can be CC'd or just tanked."
              }
            ],
            "strategy": "POSITIONING: Tank Karathress in his starting position throughout the fight. Pull advisors to separate locations - assign one tank per advisor. KILL ORDER: Caribdis FIRST (interrupt all heals), Tidalvess second (kill totems), Sharkkis third (kite pet), Karathress last. Interrupt rotation is critical - 2-3 players should rotate kicks on Caribdis. As advisors die, Karathress gains their abilities - the fight gets progressively harder. At 25%, Karathress enrages - pop Bloodlust and all cooldowns. Keep the Karathress tank above 60% health AT ALL TIMES due to Cataclysmic Bolt.",
            "commonMistakes": [
              "Not interrupting Caribdis heals, making the fight take forever",
              "Letting Karathress tank drop below 50% HP and dying to Cataclysmic Bolt",
              "Not killing Spitfire Totems, causing heavy raid damage",
              "Wrong kill order - killing Sharkkis first makes the fight significantly harder",
              "Not positioning Karathress against a wall after Tidalvess dies, causing knockback chaos"
            ],
            "lootHighlights": [
              "Gloves of the Vanquished Champion/Defender/Hero",
              "World Breaker",
              "Soul-Strider Boots",
              "Bloodsea Brigand's Vest"
            ]
          },
          {
            "name": "Morogrim Tidewalker",
            "npcId": 21213,
            "difficulty": "Medium",
            "description": "A massive sea giant guarding the entrance to Lady Vashj's lair. Morogrim is a stamina and DPS check fight - your raid needs enough health to survive Watery Grave and enough AoE damage to quickly clear murloc waves. This fight punishes low DPS with endless murloc swarms overwhelming the raid.",
            "phaseBreakdown": [
              "Main Phase: Tank and spank Morogrim. Healers top off Watery Grave targets. Repeat until Earthquake.",
              "Murloc Phase: Earthquake spawns 12 murlocs. AoE them down fast. Return to Main Phase.",
              "Cycle: Alternates between these phases until Morogrim dies or healers run out of mana."
            ],
            "abilities": [
              {
                "name": "Tidal Wave",
                "spellId": 37730,
                "description": "Frontal cone attack dealing 5,000-7,000 Frost damage to anyone in a 25-yard cone in front of Morogrim. 2-second cast.",
                "handling": "ONLY the tank should EVER be in front of Morogrim. Position raid behind and to the sides. Tank should have Frost Resistance Aura if available. This will one-shot or severely damage non-tanks."
              },
              {
                "name": "Watery Grave",
                "spellId": 38023,
                "description": "Teleports 4 random players to graves in the corners of the room. They are stunned in a water bubble for 6 seconds, taking 4,500 Frost damage over the duration. When released, Watery Globules spawn and chase them.",
                "handling": "Healers MUST pre-assign healing to grave targets. Each corner should have a healer watching. When players are released, they need immediate healing as they'll be at 25-40% health. The 4 second stun means HoTs applied beforehand help significantly."
              },
              {
                "name": "Watery Globules",
                "spellId": 37862,
                "description": "4 water globes spawn and slowly move toward the players who were just in Watery Grave. If a globe reaches its target, it explodes for 4,500 Frost damage to everyone within 10 yards.",
                "handling": "Grave targets must RUN AWAY from their globe immediately upon release. Run THROUGH the raid toward the boss - the globes are slow. If you can't escape, make sure you're not near other players when it hits. Frost Nova and slows work on globes."
              },
              {
                "name": "Earthquake",
                "spellId": 37764,
                "description": "Every 45-50 seconds, Morogrim stomps the ground, dealing 2,500 Nature damage to the entire raid and spawning 12 Murlocs from the water on both sides of the room.",
                "handling": "This is your AoE CHECK. Mages use Blizzard/Flamestrike, Warlocks use Seed of Corruption, Warriors use Whirlwind. Murlocs have low HP (~4,000) but deal significant damage in groups. If murlocs aren't dead before the next Earthquake, they stack and eventually overwhelm the raid."
              },
              {
                "name": "Murloc Tidal Spawn",
                "spellId": 39088,
                "description": "The 12 murlocs that spawn during Earthquake. They aggro random players and deal moderate melee damage. If left unchecked, subsequent waves stack.",
                "handling": "Assign dedicated AoE positions. Two groups of ranged DPS should be positioned to catch murlocs spawning from each side. Tanks can help gather them with Challenging Shout or Thunder Clap. Kill ALL murlocs before returning to boss damage."
              }
            ],
            "strategy": "POSITIONING: Tank Morogrim facing away from raid. Spread healers to cover Watery Grave corners. Group ranged DPS in two positions to handle murlocs from both sides. MAIN PHASE: Simple tank and spank. Watch for Watery Grave - heal those targets immediately upon release. Grave targets run toward boss to escape Globules. MURLOC PHASE: When Earthquake hits, STOP BOSS DPS and AoE murlocs. This is critical - if you fall behind on murlocs, you will wipe. Once murlocs are dead, return to boss. ENRAGE: 10 minutes. The fight is a DPS and healer mana check. Bring mana potions and Dark Runes for healers.",
            "commonMistakes": [
              "Anyone besides the tank standing in front of Morogrim and eating Tidal Wave",
              "Not healing Watery Grave targets immediately, letting them die to Globules",
              "Grave targets running the wrong direction and exploding Globules on the raid",
              "Not killing murlocs fast enough, causing waves to stack",
              "Healers running out of mana because the fight took too long"
            ],
            "lootHighlights": [
              "Mantle of the Tireless Tracker",
              "Luminescent Rod of the Naaru",
              "Ring of Sundered Souls",
              "Warboots of Obliteration"
            ]
          },
          {
            "name": "Lady Vashj",
            "npcId": 21212,
            "difficulty": "Very Hard",
            "description": "The Naga sea witch and final boss of Serpentshrine Cavern. Lady Vashj is one of the most complex and demanding encounters in TBC, requiring flawless coordination during the infamous Phase 2 Tainted Core relay system. This fight is the guild-breaker of Tier 5 - many raids never defeat her. Master Phase 2 or wipe forever.",
            "phaseBreakdown": [
              "Phase 1 (100%-70% HP): Tank and spank with spreading mechanics. Learn the Static Charge and Entangle patterns.",
              "Phase 2 (70%-50% HP): Vashj becomes IMMUNE. Four Shield Generators must be deactivated using Tainted Cores. Three add types spawn continuously. This phase tests raid coordination to the limit.",
              "Phase 3 (50%-0% HP): Shield down, Vashj attackable again. All Phase 1 abilities plus Toxic Spore Bats. Pure chaos - burn her before healers run out of mana."
            ],
            "phase2Mechanics": {
              "shieldGenerators": "Four generators in cardinal directions (N/E/S/W) must each be deactivated with a Tainted Core. Vashj is immune until all 4 are down.",
              "taintedCores": "Dropped by Tainted Elementals. Player holding a core is ROOTED and takes 500 nature damage/sec. Must throw to another player (45 yard range) who catches and relays it to the generator.",
              "coreRelay": "Assign relay teams for each generator direction. Looter picks up core  throws to relay 1  relay 1 throws to relay 2  relay 2 uses core on generator. Practice this!",
              "coreThrowMacro": "/target [your relay partner name]\n/use Tainted Core"
            },
            "phase2Adds": [
              {
                "name": "Coilfang Elite",
                "type": "Melee Naga",
                "handling": "Spawn from the stairs. Must be tanked by off-tanks. They hit hard - keep tanks alive. Kill when there's downtime from cores."
              },
              {
                "name": "Coilfang Strider",
                "type": "Caster Naga",
                "handling": "MOST DANGEROUS ADD. Mind Controls random players if it reaches them. Must be KITED by a Frost Mage or Hunter. NEVER let it reach the raid. Perma-slow and kite in circles."
              },
              {
                "name": "Tainted Elemental",
                "type": "Core Carrier",
                "handling": "Spawn near generators. Kill immediately - they despawn after 15 seconds and drop the Tainted Core. Miss too many and Phase 2 becomes impossible."
              },
              {
                "name": "Enchanted Elemental",
                "type": "Small Adds",
                "handling": "Weak adds that heal Vashj if they reach her. Kill with cleave damage or have a dedicated add tank."
              }
            ],
            "abilities": [
              {
                "name": "Shoot",
                "spellId": 38295,
                "description": "Ranged attack dealing 4,000-6,000 Physical damage. Used on her primary threat target in Phases 1 and 3. Also Multi-Shots in Phase 3.",
                "handling": "Tank stands at max range. Use high-stamina gear. In Phase 3, this hurts more due to her damage buff."
              },
              {
                "name": "Shock Blast",
                "spellId": 38509,
                "description": "8-yard AoE around Vashj dealing 8,000-9,000 Nature damage. 5-second cast with visual warning.",
                "handling": "MELEE RUN OUT when you see the cast bar. Return after it goes off. This will one-shot most melee if they don't move."
              },
              {
                "name": "Static Charge",
                "spellId": 38280,
                "description": "Debuff on a random player that chains 2,000 Nature damage to anyone within 10 yards every 2 seconds for 20 seconds.",
                "handling": "SPREAD OUT 12+ yards at all times. If you get Static Charge, do NOT move toward other players. Stay isolated until it expires. Getting Static Charged while grouped causes a chain reaction wipe."
              },
              {
                "name": "Entangle",
                "spellId": 38316,
                "description": "Roots 5 random players in place and spawns a Spore Bat on each. Bats explode for 2,000 Nature damage in a radius when killed.",
                "handling": "Kill the bats fast, but not when people are clumped. Ranged DPS should focus bats. Rooted players can still cast and attack. The root breaks after a few seconds."
              },
              {
                "name": "Tainted Core",
                "spellId": 38132,
                "description": "Phase 2 item dropped by Tainted Elementals. Holding it roots you and deals damage over time. Can be thrown to another player within 45 yards.",
                "handling": "Assign core relay teams before the pull. The player who loots the core throws to their relay partner using a /use Tainted Core macro. The final person in the relay uses the core on the generator. Do NOT hold a core for more than 5-6 seconds or you die."
              },
              {
                "name": "Forked Lightning",
                "spellId": 38145,
                "description": "Phase 3 only. Chain lightning hitting multiple targets for 2,500 Nature damage each.",
                "handling": "Stay spread. Healers need to react quickly to top people off. This adds significant raid damage in Phase 3."
              },
              {
                "name": "Toxic Spore Bat",
                "spellId": 38575,
                "description": "Phase 3 only. Spawns bats that leave a poison cloud when they die. Clouds deal heavy Nature damage.",
                "handling": "Ranged DPS kills bats AWAY from the raid. Do not kill them near melee or the tank. The clouds are deadly."
              }
            ],
            "strategy": "PHASE 1: Tank Vashj at her platform. Raid spreads out 12+ yards for Static Charge. Melee run out during Shock Blast. Kill Spore Bats when Entangle happens. Simple phase - use it to learn the rhythm. PHASE 2: This is the guild-breaker. Split raid into 4 teams (one per generator direction). Each team has: 1 core looter, 1-2 relay throwers, 1 person to use core on generator. Tanks handle Coilfang Elites. Frost Mage kites Striders PERMANENTLY. When Tainted Elementals spawn, kill them fast, loot the core, relay to generator. You need 4 successful core relays to end Phase 2. Communication is CRITICAL. PHASE 3: Pop Heroism/Bloodlust immediately. All Phase 1 mechanics plus Forked Lightning and Spore Bats. Kill bats away from raid. Burn Vashj before healers go OOM. This phase is pure chaos - if Phase 2 took too long, you won't have the mana to finish.",
            "commonMistakes": [
              "Not spreading 12 yards for Static Charge - chains kill multiple people",
              "Holding Tainted Core too long and dying instead of throwing it",
              "Letting Striders reach the raid and Mind Control people",
              "Missing Tainted Elemental spawns in Phase 2, extending the phase",
              "Killing Spore Bats near the raid in Phase 3, creating death clouds",
              "Not practicing core relay before pulling - Phase 2 requires precise coordination"
            ],
            "lootHighlights": [
              "Vashj's Vial Remnant (Hyjal attunement)",
              "Helm of the Vanquished Champion/Defender/Hero",
              "Fang of Vashj",
              "Krakken-Heart Breastplate",
              "Lightfathom Scepter"
            ]
          }
        ]
      },
      "tempest_keep": {
        "name": "Tempest Keep: The Eye",
        "shortName": "TK",
        "size": 25,
        "location": "Netherstorm",
        "attunement": "The Tempest Key (requires killing Lady Vashj in SSC)",
        "description": "Kael'thas Sunstrider's flying fortress. Features 4 bosses culminating in the epic Kael'thas encounter, one of the most complex fights in TBC.",
        "recommendedComposition": {
          "tanks": 4,
          "healers": 7,
          "dps": 14,
          "notes": "Kael'thas requires 4 tanks minimum for Phase 3 advisors. Bring multiple Mages for add control. Warlocks are essential for healthstones during the long Kael fight. Shamans for Bloodlust/Heroism timing on Phase 4."
        },
        "minimumGear": {
          "tanks": "15,000+ health unbuffed, 490 Defense, SSC gear recommended",
          "healers": "1,400+ healing power, 10,000+ mana, Fire Resistance gear helpful",
          "dps": "Full SSC gear or equivalent, flasks required for Kael progression"
        },
        "tierTokens": "Tier 5 Chest and Shoulders tokens drop here",
        "bosses": [
          {
            "name": "Al'ar",
            "npcId": 19514,
            "difficulty": "Medium",
            "description": "The magnificent phoenix of Tempest Keep. Al'ar is a two-phase fight where the boss flies between elevated platforms in Phase 1, then rebirths in the center for Phase 2. The fight teaches basic TK mechanics like tank swaps and coordinated movement. Beautiful to witness when executed properly.",
            "phaseBreakdown": [
              "Phase 1 (Platform Phase): Al'ar flies between 4 upper platforms. Tanks must position on each platform and taunt when Al'ar lands. Raid handles adds and moves for Flame Quills.",
              "Phase 2 (Ground Phase - 0% HP): Al'ar 'dies' and rebirths in the center with full HP. Standard tanking on the ground floor. Dodge Meteor dives and tank swap on Melt Armor."
            ],
            "platformLayout": {
              "description": "Four elevated platforms connected by ramps. Al'ar spawns on Platform 1 and rotates clockwise.",
              "positioning": "Assign 2 tanks total - one on Platform 1 and 3 (opposite sides), one handles 2 and 4. Ranged DPS spreads on lower platforms/ramps."
            },
            "abilities": [
              {
                "name": "Flame Buffet",
                "spellId": 34121,
                "description": "Stacking debuff increasing Fire damage taken by 10% per stack. Applied every few seconds to anyone in melee range. Stacks persist for 10 seconds.",
                "handling": "Tank swap at 4-5 stacks. When Al'ar flies to a new platform, the current tank's stacks drop. This natural reset is part of the Phase 1 rhythm."
              },
              {
                "name": "Flame Quills",
                "spellId": 34229,
                "description": "Al'ar flies to the center of the room and shoots flames at ALL FOUR PLATFORMS simultaneously. Deals 8,000+ Fire damage per second to anyone on a platform. Lasts about 10 seconds.",
                "handling": "EVERYONE evacuate platforms and stand on ramps/center floor. This is announced by Al'ar flying to room center. Return to platforms after Quills ends. Missing this = instant death."
              },
              {
                "name": "Ember Blast",
                "spellId": 34133,
                "description": "When Al'ar transitions to a new platform, it spawns an Ember add at the previous location. Embers have ~25,000 HP and cast Ember Blast, a 2-second AoE dealing 8,000-10,000 Fire damage.",
                "handling": "Kill Embers FAST. Assign 2-3 ranged DPS to focus Embers. If they cast Ember Blast, it hurts. Alternatively, have a tank grab them and cleave down."
              },
              {
                "name": "Rebirth",
                "spellId": 34342,
                "description": "When Al'ar reaches 0% HP in Phase 1, it dies and immediately rebirths in the center of the room with full health. Phase 2 begins.",
                "handling": "All raid members move to the center floor. Tank picks up Al'ar facing away. This is NOT the end of the fight - you must kill Al'ar again in Phase 2."
              },
              {
                "name": "Meteor",
                "spellId": 35181,
                "description": "Phase 2 only. Al'ar flies into the air and dives at a random player's location, dealing 5,000-6,000 Fire damage split among everyone within 10 yards of impact.",
                "handling": "Stack loosely in groups of 4-5 players to split damage. Solo-soaking a Meteor is deadly. Spread slightly to avoid overlap with other mechanics, but close enough to share Meteor damage."
              },
              {
                "name": "Melt Armor",
                "spellId": 35410,
                "description": "Phase 2 only. Reduces the tank's armor by 80% for 60 seconds. This makes the tank take massive physical damage.",
                "handling": "IMMEDIATE tank swap when Melt Armor is applied. The debuffed tank should NOT have aggro. Use Shield Wall or other major cooldowns if you get caught with Melt Armor and aggro."
              },
              {
                "name": "Charge",
                "spellId": 35412,
                "description": "Phase 2 only. Al'ar charges a random player, dealing Fire damage and knockback.",
                "handling": "Healers be ready to top off charge targets. Not usually deadly but adds to the chaos."
              }
            ],
            "strategy": "PHASE 1: Two tanks alternate platforms. When Al'ar lands on your platform, taunt and tank facing away. When it moves, stay put - it'll come back. Kill Ember adds quickly. During Flame Quills (Al'ar flies to center), EVERYONE gets off platforms - stand on ramps or floor. Return after Quills ends. PHASE 2: Al'ar rebirths in center. Tank it on the floor, raid loosely stacks behind. Tank swap immediately when Melt Armor is applied. Spread slightly for Meteor but stay close enough to split damage. Pop Heroism/Bloodlust and burn. Phase 2 is simpler than Phase 1.",
            "commonMistakes": [
              "Standing on platforms during Flame Quills - instant death",
              "Not tank swapping on Melt Armor - tank gets crushed",
              "Letting Ember adds free-cast - huge raid damage",
              "Thinking Phase 1 death means the fight is over - Phase 2 is the real fight",
              "Solo-soaking Meteor instead of stacking - likely death"
            ],
            "lootHighlights": [
              "Ashes of Al'ar (0.01% mount drop)",
              "Talon of Al'ar",
              "Phoenix-Ring of Rebirth",
              "Claw of the Phoenix"
            ]
          },
          {
            "name": "Void Reaver",
            "npcId": 19516,
            "difficulty": "Easy",
            "description": "A massive Arcane Golem constructed by Kael'thas. Affectionately known as 'Loot Reaver' by the community because of how easy it is compared to other Tier 5 content. This fight serves as a gear check - if you can survive Pounding and avoid Arcane Orbs, you win. Many guilds kill Void Reaver before progressing through SSC.",
            "phaseBreakdown": [
              "Single Phase: Tank and spank the entire fight. No phase transitions. Simply avoid orbs and heal through Pounding."
            ],
            "abilities": [
              {
                "name": "Pounding",
                "spellId": 34162,
                "description": "Every 12-14 seconds, Void Reaver channels for 3 seconds, dealing 1,350-1,650 Arcane damage to the entire raid every second (4,000-5,000 total). This is unavoidable.",
                "handling": "Healers PRE-CAST AoE heals before Pounding ends. Chain Heal, Circle of Healing, Prayer of Healing. Everyone should be topped off before Pounding starts. If raid is low when Pounding begins, people will die."
              },
              {
                "name": "Arcane Orb",
                "spellId": 34172,
                "description": "Launches a slow-moving purple orb at a random player beyond 18 yards. The orb travels for several seconds, then EXPLODES for 6,000-7,000 Arcane damage to everyone within 20 yards of impact.",
                "handling": "SPREAD OUT 20+ yards apart. Watch for orbs coming your direction. If one is heading for you, MOVE. The orb is slow - you have time to react. If an orb lands in a clump of players, multiple people die."
              },
              {
                "name": "Knock Away",
                "spellId": 25778,
                "description": "Every 20-25 seconds, Void Reaver knocks the tank back and reduces their threat by 25%. This can cause aggro loss.",
                "handling": "Tank with your back against a wall to prevent knockback distance. Have an off-tank ready to taunt if the main tank loses aggro. Warriors should have an emergency taunt ready."
              },
              {
                "name": "Melee Attacks",
                "spellId": 0,
                "description": "Void Reaver hits hard in melee - approximately 5,000-7,000 damage per swing on a geared tank.",
                "handling": "This is a tank gear check. Tanks need 15,000+ HP and good mitigation. Keep tank at high health to survive Pounding on top of melee."
              }
            ],
            "strategy": "POSITIONING: Tank pulls Void Reaver to a wall and tanks with back against it (prevents knockback). Ranged and healers spread out in a wide semicircle at 20-30 yard range, at least 20 yards apart from each other. Melee stack behind the boss. THE FIGHT: Pure tank and spank. Tank holds threat (watch for Knock Away aggro resets). Ranged watches for Arcane Orbs and moves out of the way. Healers pre-heal before Pounding ends. That's it. This is legitimately one of the easiest bosses in Tier 5, which is why guilds farm it early for shoulder tokens.",
            "commonMistakes": [
              "Ranged not spreading out, causing Arcane Orb to hit multiple people",
              "Not moving when an orb is clearly heading toward you",
              "Tank not against a wall, getting knocked far and losing aggro",
              "Healers not pre-casting heals, letting Pounding kill low-HP players",
              "Underestimating the fight and bringing undergeared tanks"
            ],
            "lootHighlights": [
              "Pauldrons of the Vanquished Champion/Defender/Hero (Tier 5 Shoulders)",
              "Void Reaver Greaves",
              "Fel Reaver's Piston",
              "Wristguards of Determination"
            ]
          },
          {
            "name": "High Astromancer Solarian",
            "npcId": 18805,
            "difficulty": "Medium",
            "description": "A Blood Elf astromancer who calls upon the power of the stars and eventually transforms into a voidwalker. The infamous 'bomb' mechanic tests your raid's awareness - one person not running out can wipe the entire group. Also features split phases where Solarian disappears and adds spawn.",
            "phaseBreakdown": [
              "Phase 1 (100%-20% HP): Solarian cycles between attacking and disappearing to spawn adds. Bomb mechanic is active.",
              "Split Phase: Every 50 seconds, Solarian vanishes and spawns adds in a specific location. Kill adds, she returns.",
              "Phase 2 (20%-0% HP): Solarian transforms into a Voidwalker. No more bombs, just burn her down."
            ],
            "abilities": [
              {
                "name": "Arcane Missiles",
                "spellId": 33031,
                "description": "Channels a barrage of Arcane Missiles at the tank, dealing 2,500-3,500 damage per missile (5-6 missiles total).",
                "handling": "Tank damage is moderate but consistent. Healers should maintain steady healing on the tank. Not particularly dangerous if tank is geared."
              },
              {
                "name": "Wrath of the Astromancer",
                "spellId": 33045,
                "description": "Marks a random player as a LIVING BOMB. After 6 seconds, they explode for 5,400-6,600 Arcane damage to everyone within 10 yards. The bomb player takes moderate damage as well.",
                "handling": "THE MOST IMPORTANT MECHANIC. If you get the bomb debuff, RUN AWAY FROM EVERYONE immediately. Get at least 15 yards from any other player. Do NOT run toward the healers. If you explode near the raid, you likely wipe. Watch your debuffs!"
              },
              {
                "name": "Blinding Light",
                "spellId": 33009,
                "description": "AoE knockback and 2,500-3,500 Arcane damage to everyone within 20 yards. Also disorients for 2 seconds.",
                "handling": "Melee should expect to be knocked back and disoriented. Run back in after it fades. Tanks should be positioned to avoid getting knocked away from the boss."
              },
              {
                "name": "Split Phase - Adds",
                "spellId": 0,
                "description": "Every 50 seconds, Solarian teleports to a random room location, goes immune, and spawns 4 Solarium Agents (weak casters) and 2 Solarium Priests (healers that buff Agents).",
                "handling": "Kill Agents first - they cast Arcane damage on the raid. Then kill Priests. The Agents will gain Blessing of Might from Priests if you let Priests live. AoE damage works well. Solarian returns after 15-20 seconds."
              },
              {
                "name": "Solarium Agent",
                "spellId": 0,
                "description": "Weak caster adds spawning during Split Phase. Cast Arcane spells at random targets.",
                "handling": "Kill quickly with AoE. Low HP but annoying if left alive."
              },
              {
                "name": "Solarium Priest",
                "spellId": 0,
                "description": "Healer adds spawning during Split Phase. Cast Greater Heal on Agents and buff them with Blessing of Might.",
                "handling": "Lower priority than Agents but should die second. Interrupt heals if possible."
              },
              {
                "name": "Void Form",
                "spellId": 39625,
                "description": "At 20% HP, Solarian permanently transforms into a Voidwalker. She gains: Void Bolt (6,000 Shadow damage nuke), and Psychic Scream (AoE fear). No more bombs or split phases.",
                "handling": "Pop Heroism/Bloodlust and burn. Tank faces her away. Tremor Totems and Fear Ward help with Psychic Scream. This phase is simple - just avoid the fear and kill her."
              }
            ],
            "strategy": "POSITIONING: Tank Solarian in the center of the room. Raid spreads loosely around her - at least 10 yards between players for bomb explosions. Mark a 'bomb spot' far from the raid where bomb targets should run. PHASE 1: Tank and spank until bomb. When you get bomb, IMMEDIATELY run to the designated safe spot. During Split Phase (she vanishes), group up and AoE the adds - Agents first, then Priests. Return to spread positions when she comes back. PHASE 2 (Void Form at 20%): Pop cooldowns, group up for cleave/AoE heals, burn her down. Fear management with Tremor Totems helps. Simple burn phase.",
            "commonMistakes": [
              "Not running out when you get bomb - wipes the melee or healers",
              "Running the wrong direction with bomb - toward healers instead of away",
              "Not spreading out enough during Phase 1",
              "Ignoring adds during Split Phase, causing them to overwhelm healers",
              "Panicking during Void Form fear instead of using Tremor/Fear Ward"
            ],
            "lootHighlights": [
              "Leggings of the Vanquished Champion/Defender/Hero (Tier 5 Legs)",
              "Void Star Talisman",
              "Girdle of the Righteous Path",
              "Ethereum Life-Staff"
            ]
          },
          {
            "name": "Kael'thas Sunstrider",
            "npcId": 19622,
            "difficulty": "Very Hard",
            "description": "The Lord of the Blood Elves and the most complex encounter in The Burning Crusade. This 5-phase, 15-20 minute fight is legendary for its difficulty and is considered by many to be the hardest boss in TBC. The fight features four advisors, seven legendary weapons, and the famous Gravity Lapse mechanic. Guilds spend weeks learning this encounter. Prepare for many, many wipes.",
            "phaseBreakdown": [
              "Phase 1 (Advisors): Four advisors engage one at a time with 10-second gaps. Kill each before the next activates. ~3 minutes.",
              "Phase 2 (Weapons): Seven legendary weapons animate and attack. Kill and LOOT them - they provide crucial buffs for later phases. ~2 minutes.",
              "Phase 3 (Advisors Resurrected): ALL FOUR advisors resurrect at once. Kill them again while using your new weapons. ~2-3 minutes.",
              "Phase 4 (Kael'thas Active): Kael'thas himself joins the fight. Manage Phoenixes, Mind Control, and high tank damage. ~5-6 minutes.",
              "Phase 5 (Gravity Lapse - 50% HP): Everyone floats in the air. Avoid Nether Vapor orbs while DPSing Kael'thas. Cycles between flight and ground phases until dead."
            ],
            "advisors": [
              {
                "name": "Thaladred the Darkener (First)",
                "role": "Melee - NO AGGRO TABLE",
                "abilities": "Gaze: Fixates on a random player and chases them. Silence: AoE silence around him. Psychic Blow: Huge knockback on current target.",
                "strategy": "KITE HIM. Whoever gets Gaze runs away while ranged DPS kills him. He cannot be tanked traditionally. Stay spread to avoid Silence hitting multiple people."
              },
              {
                "name": "Lord Sanguinar (Second)",
                "role": "Paladin Tank",
                "abilities": "Bellowing Roar: AoE fear. Standard melee attacks.",
                "strategy": "Normal tanking. Use Tremor Totem and Fear Ward for fear. Simple tank and spank compared to Thaladred."
              },
              {
                "name": "Grand Astromancer Capernian (Third)",
                "role": "Mage - EXTREMELY DANGEROUS",
                "abilities": "Fireball: 5,500-6,500 Fire damage. Conflagration: AoE 6,000+ Fire damage + DoT. Arcane Burst: 10,000+ damage if anyone is within 10 yards.",
                "strategy": "RANGED ONLY TANK. A Mage or Warlock tanks her at max range. She cannot be approached in melee due to Arcane Burst. Interrupt Fireballs if possible."
              },
              {
                "name": "Master Engineer Telonicus (Fourth)",
                "role": "Engineer with Gadgets",
                "abilities": "Bomb: Stuns target for 4 seconds. Remote Toy: Spawns robots that must be killed.",
                "strategy": "Normal tanking. Kill robots when they spawn. Watch for Bomb stuns on tanks - off-tank should be ready."
              }
            ],
            "legendaryWeapons": [
              {"name": "Staff of Disintegration", "priority": "Warlock", "effect": "+200% melee damage, reduces threat. CRITICAL for Phase 3+ DPS."},
              {"name": "Cosmic Infuser", "priority": "Holy Paladin/Priest", "effect": "+100% healing, AoE heal on use."},
              {"name": "Devastation", "priority": "Warrior/Rogue", "effect": "+200% melee damage, stun proc."},
              {"name": "Netherstrand Longbow", "priority": "Hunter", "effect": "+200% ranged damage, multi-shot proc."},
              {"name": "Infinity Blade", "priority": "Rogue/Fury Warrior", "effect": "+200% melee damage, attack speed increase."},
              {"name": "Warp Slicer", "priority": "Rogue/DPS Warrior", "effect": "+200% melee damage, armor ignore."},
              {"name": "Phaseshift Bulwark", "priority": "Tank", "effect": "Absorb shield on use. CRITICAL for Phase 5."}
            ],
            "abilities": [
              {
                "name": "Fireball",
                "spellId": 36805,
                "description": "Standard 3-second cast dealing 15,000-20,000 Fire damage to the tank. Cast frequently.",
                "handling": "Tank needs to stay topped off at all times. Fire Resistance Aura and Fire protection potions help. Interruptible but Kael'thas has fast cast recovery."
              },
              {
                "name": "Flamestrike",
                "spellId": 36735,
                "description": "Places a Flamestrike on a random player's location. Deals 6,000-8,000 initial Fire damage plus 3,000/sec for 8 seconds in the zone.",
                "handling": "MOVE OUT of the red circle immediately. These zones persist and restrict movement space over time."
              },
              {
                "name": "Phoenix",
                "spellId": 36723,
                "description": "Summons a Phoenix add that leaves a trail of fire as it moves. When killed, it drops an egg. If the egg is not destroyed in 15 seconds, the Phoenix respawns.",
                "handling": "Assign a tank to kite the Phoenix away from the raid. Ranged DPS kills it, then IMMEDIATELY kills the egg. Missing an egg means dealing with another Phoenix."
              },
              {
                "name": "Mind Control",
                "spellId": 36797,
                "description": "Mind Controls a random player. The MC'd player gains 30% increased damage and can attack allies.",
                "handling": "CC the MC'd player with Polymorph, Fear, or other control. Do NOT kill them. The MC breaks after ~30 seconds or can be broken by the Staff of Disintegration weapon."
              },
              {
                "name": "Shock Barrier",
                "spellId": 36815,
                "description": "At set intervals, Kael'thas shields himself (100,000 damage absorb) and begins casting Pyroblast (10,000-12,000 Fire damage). If Pyroblast completes, someone dies.",
                "handling": "ALL DPS must STOP EVERYTHING and burn the Shock Barrier immediately. Breaking the barrier interrupts Pyroblast. This is a DPS check - failing means death."
              },
              {
                "name": "Gravity Lapse",
                "spellId": 35941,
                "description": "Phase 5: Everyone is lifted into the air and can 'swim' in 3D space. Nether Vapor orbs spawn and deal 2,000 Shadow damage on contact. Lasts 30 seconds, then drops everyone to the ground.",
                "handling": "USE YOUR PHASESHIFT BULWARK before you hit the ground to absorb fall damage. While flying, avoid all orbs - they spawn from Kael'thas and drift toward players. Stay spread, keep DPSing. After landing, normal combat resumes until next Gravity Lapse."
              },
              {
                "name": "Nether Vapor",
                "spellId": 35859,
                "description": "Small purple orbs that spawn during Gravity Lapse. Each orb deals 2,000 Shadow damage and reduces max HP by 10% for 30 seconds on contact.",
                "handling": "AVOID ALL ORBS. The HP reduction stacks. Touching 3-4 orbs means you die when Gravity Lapse ends. Navigate carefully - they move slowly."
              },
              {
                "name": "Nether Beam",
                "spellId": 35873,
                "description": "During Gravity Lapse, Kael'thas fires Shadow beams at random players for 3,000 damage.",
                "handling": "Healers continue healing during Gravity Lapse. This is unavoidable damage."
              }
            ],
            "strategy": "PHASE 1: Kill advisors in order - Thaladred (kite), Sanguinar (tank), Capernian (ranged tank), Telonicus (tank). 10 seconds between each activation. PHASE 2: Kill all 7 weapons and LOOT THEM. Assign weapons before pull. Staff goes to Warlock, Bow to Hunter, etc. PHASE 3: All 4 advisors resurrect. CC Capernian immediately (Polymorph). Kill Thaladred first (still kite), then Sanguinar, then Telonicus, then Capernian. PHASE 4: Kael'thas is active. Tank and spank. Off-tank kites Phoenix, DPS kills Phoenix and egg. CC Mind Controlled players. When Shock Barrier appears, ALL DPS switches and breaks it before Pyroblast. PHASE 5 (50% HP): Gravity Lapse cycles. When flying, avoid orbs, DPS Kael'thas. Before landing, USE PHASESHIFT BULWARK. Ground phase resumes until next Gravity Lapse. Repeat until dead. Pop Heroism during a ground phase below 30%.",
            "commonMistakes": [
              "Not looting weapons in Phase 2 - massive DPS and utility loss",
              "Not using Phaseshift Bulwark before landing during Gravity Lapse - death",
              "Failing to break Shock Barrier in time - Pyroblast kills someone",
              "Letting Phoenix eggs hatch - doubled Phoenix problems",
              "Standing near Capernian in Phase 3 - Arcane Burst kills melee",
              "Touching multiple Nether Vapor orbs - HP reduction stacks = death"
            ],
            "lootHighlights": [
              "Verdant Sphere (Mount Hyjal attunement)",
              "Chestguard of the Vanquished Champion/Defender/Hero (Tier 5 Chest)",
              "Ashes of Al'ar (from Al'ar, not Kael'thas)",
              "Thalassian Wildercloak",
              "Royal Gauntlets of Silvermoon"
            ]
          }
        ]
      }
    }
  },
  "phase3": {
    "name": "Phase 3: Tier 6 Content",
    "description": "The third raiding tier features Mount Hyjal and Black Temple, home to Illidan Stormrage. These raids represent the pinnacle of TBC raiding before Sunwell.",
    "raids": {
      "mount_hyjal": {
        "name": "The Battle for Mount Hyjal",
        "shortName": "Hyjal",
        "size": 25,
        "location": "Caverns of Time, Tanaris",
        "attunement": "Vials of Eternity (requires killing Vashj and Kael'thas)",
        "description": "A unique wave-defense raid set during the Battle of Mount Hyjal from Warcraft III. You'll fight alongside Jaina Proudmoore and Thrall to defend their bases against waves of Scourge and Burning Legion forces. Each boss is preceded by 8 waves of trash - wipe on trash and you restart from wave 1. This raid is more about endurance and AoE than traditional boss mechanics.",
        "recommendedComposition": {
          "tanks": 4,
          "healers": 7,
          "dps": 14,
          "notes": "Heavy AoE damage dealers (Warlocks, Mages) are essential for trash waves. Bring Shadow Priests for mana return on Kaz'rogal. Ensure multiple Fear Ward/Tremor Totems for Archimonde."
        },
        "minimumGear": {
          "tanks": "16,000+ health unbuffed, full SSC/TK gear, Shadow Resistance set for Archimonde",
          "healers": "1,600+ healing power, 11,000+ mana, Arcane Resistance pieces helpful",
          "dps": "Full Tier 5 or equivalent. Archmonde requires flasks and consumables."
        },
        "trashWaveInfo": "Each boss is preceded by 8 waves of trash. Waves spawn every 2 minutes. If you wipe on ANY wave, you restart from wave 1. Jaina/Thrall's NPCs help tank and damage but can die. Managing mana and cooldowns across all 8 waves is critical.",
        "tierTokens": "Tier 6 Gloves and Helm tokens drop here",
        "bosses": [
          {
            "name": "Rage Winterchill",
            "npcId": 17767,
            "difficulty": "Medium",
            "description": "A powerful Lich commanding the first assault on the Alliance base. After surviving 8 waves of Ghouls, Crypt Fiends, Abominations, Necromancers, and Banshees, Winterchill himself attacks. This is primarily a healing and positioning check.",
            "phaseBreakdown": [
              "Single Phase: Tank and spank with movement for Death and Decay. Spread for Icebolt. Heal through consistent Frost damage."
            ],
            "abilities": [
              {
                "name": "Icebolt",
                "spellId": 31249,
                "description": "Fires a bolt at a random player dealing 4,250-5,750 Frost damage and encasing them in ice for 4 seconds. The player cannot move, attack, or be healed while frozen.",
                "handling": "Spread out so Icebolt only hits one person. Healers must top off the frozen player IMMEDIATELY when they break out - they'll be at reduced health. This is unavoidable raid damage that tests healer reactions."
              },
              {
                "name": "Frost Nova",
                "spellId": 31250,
                "description": "AoE Frost spell around Winterchill dealing 2,500-3,500 Frost damage and rooting all players within 15 yards for 4 seconds.",
                "handling": "Melee must be ready to get rooted. Use trinkets or simply wait it out. Don't panic - the root breaks after 4 seconds. Healers keep melee alive during root."
              },
              {
                "name": "Frost Armor",
                "spellId": 31256,
                "description": "Passive buff on Winterchill. Melee attackers have a chance to be slowed by 30% and take minor Frost damage.",
                "handling": "This cannot be removed or avoided. Melee just deal with the slow. It's annoying but not dangerous."
              },
              {
                "name": "Death and Decay",
                "spellId": 31258,
                "description": "Places a large green zone on the ground lasting 15 seconds. Standing in it deals 2,500 Shadow damage per second - rapidly fatal.",
                "handling": "MOVE OUT IMMEDIATELY when you see the green circle. The zone is large but stationary. The boss will continue casting this throughout the fight, eventually limiting available space."
              }
            ],
            "strategy": "TRASH WAVES: AoE down each wave efficiently. Mages Blizzard, Warlocks Seed of Corruption, Warriors Whirlwind. Save cooldowns for Abomination waves. BOSS: Tank Winterchill near Jaina's base with raid spread behind. When Death and Decay drops, move as a group. Healers react quickly to Icebolt victims when they break free. Keep melee alive through Frost Nova roots. Simple fight if you survived the trash.",
            "commonMistakes": [
              "Standing in Death and Decay - rapid death",
              "Not healing Icebolt victims immediately after they break free",
              "Running out of mana on trash waves before the boss spawns",
              "Clumping up and having multiple people frozen by Icebolt"
            ],
            "lootHighlights": [
              "Bracers of Martyrdom",
              "Chronicle of Dark Secrets",
              "Cuffs of Devastation",
              "Gloves of the Vanquished Champion/Defender/Hero (Tier 6)"
            ]
          },
          {
            "name": "Anetheron",
            "npcId": 17808,
            "difficulty": "Medium",
            "description": "A Nathrezim Dreadlord leading the second assault on the Alliance base. His Infernal summons and Vampiric Aura healing make this a DPS race with heavy add management. The infamous Carrion Swarm can devastate poorly positioned raids.",
            "phaseBreakdown": [
              "Single Phase: Tank and spank while managing Infernal adds. DPS must overcome Vampiric Aura healing."
            ],
            "abilities": [
              {
                "name": "Carrion Swarm",
                "spellId": 31306,
                "description": "Frontal cone attack dealing 4,500-6,500 Shadow damage and reducing all healing received by 75% for 20 seconds. Hits everyone in a wide cone in front of the boss.",
                "handling": "ONLY THE TANK should be in front of Anetheron. If Carrion Swarm hits the raid, healing is nearly impossible for 20 seconds. Position boss facing away with raid behind. Dispel the healing reduction immediately - it's a Magic debuff."
              },
              {
                "name": "Sleep",
                "spellId": 31298,
                "description": "Puts up to 3 random targets to sleep for 10 seconds. Any damage breaks the sleep.",
                "handling": "Healers should be assigned to dispel Sleep quickly, especially if it hits tanks. DPS can break each other out with minor damage. Not deadly but annoying."
              },
              {
                "name": "Inferno",
                "spellId": 31299,
                "description": "Calls down an Infernal meteor at a random player's location every 45 seconds. The impact deals 2,500-3,500 Fire damage in a radius. The Infernal persists as an add with 500,000 HP and moderate melee damage.",
                "handling": "Move away from the impact zone (red circle on ground). Off-tanks must pick up Infernals immediately - they can wreck healers if loose. Kite or tank Infernals away from the raid. Most guilds ignore them and burn the boss."
              },
              {
                "name": "Vampiric Aura",
                "spellId": 31317,
                "description": "Passive aura healing Anetheron for 300% of all melee damage he deals. This creates a constant stream of self-healing.",
                "handling": "This is why the fight is a DPS race. Your raid DPS must significantly exceed his healing. Focus all damage on Anetheron and ignore Infernals if your DPS is high enough. Pop Heroism/Bloodlust early."
              }
            ],
            "strategy": "POSITIONING: Tank Anetheron facing AWAY from the raid at all times. Never let Carrion Swarm hit anyone except the tank. ADDS: Off-tanks pick up Infernals as they spawn. Either kite them forever or tank them away from raid. Most guilds ignore them and DPS race the boss. DPS RACE: Vampiric Aura heals him constantly. Pop cooldowns early and burn. Dispel Sleep and Carrion Swarm debuffs immediately.",
            "commonMistakes": [
              "Carrion Swarm hitting the raid - healing reduction is devastating",
              "Not picking up Infernals, letting them kill healers",
              "DPS too low to overcome Vampiric Aura healing",
              "Not dispelling Sleep from tanks"
            ],
            "lootHighlights": [
              "Don Rodrigo's Poncho",
              "Golden Links of Restoration",
              "Anetheron's Noose",
              "Pillar of Ferocity"
            ]
          },
          {
            "name": "Kaz'rogal",
            "npcId": 17888,
            "difficulty": "Medium-Hard",
            "description": "A massive Doom Guard leading the assault on the Horde base. His infamous Mark of Kaz'rogal drains mana - if you hit 0 mana, you EXPLODE and deal massive damage to nearby allies. This fight is a mana management nightmare for casters and healers.",
            "phaseBreakdown": [
              "Single Phase: Tank and spank while managing mana drain. Players running low on mana must run out before exploding."
            ],
            "abilities": [
              {
                "name": "Cleave",
                "spellId": 31345,
                "description": "Frontal cleave dealing 7,000-9,000 Physical damage to everyone in front of the boss.",
                "handling": "ONLY the tank should be in front. Standard melee positioning - all DPS behind the boss."
              },
              {
                "name": "War Stomp",
                "spellId": 31480,
                "description": "AoE attack dealing 2,000-3,000 Physical damage and stunning everyone within 15 yards for 5 seconds.",
                "handling": "Melee will get stunned frequently. Healers should NOT all be in stomp range - spread healers so at least some can heal during stuns. The stun is short but dangerous if the tank is low."
              },
              {
                "name": "Mark of Kaz'rogal",
                "spellId": 31447,
                "description": "Every 45 seconds, drains 600 mana per second from ALL players for 5 seconds (3,000 total mana drained). If ANY player reaches 0 mana, they EXPLODE dealing 10,000 Shadow damage to everyone within 15 yards.",
                "handling": "THIS IS THE FIGHT. Mana users MUST manage their mana carefully. Use Mana Potions, Dark Runes, and mana cooldowns (Innervate, Mana Tide) during Mark. If you're about to hit 0 mana, RUN AWAY from the raid IMMEDIATELY before you explode. Shadow Priests with Vampiric Touch are incredible here."
              }
            ],
            "strategy": "POSITIONING: Tank faces boss away. Melee behind boss. Healers and casters spread out 15+ yards from each other (so explosions don't chain). MANA MANAGEMENT: Before each Mark of Kaz'rogal, check your mana. Use consumables during the drain. If you're going to bottom out, RUN OUT of the raid before you explode. Warlocks can Life Tap to avoid explosion (0 mana but not dead = no explosion). KILL PRIORITY: Non-mana DPS (Rogues, Hunters) are critical for this fight since they can't explode.",
            "commonMistakes": [
              "Casters/healers exploding in the middle of the raid",
              "Not using mana consumables during Mark",
              "Healers all getting stunned by War Stomp at the same time",
              "Running out of mana on trash waves before the boss"
            ],
            "lootHighlights": [
              "Hammer of Atonement",
              "Black Featherlight Boots",
              "Kaz'rogal's Hardened Heart",
              "Belt of Seething Fury"
            ]
          },
          {
            "name": "Azgalor",
            "npcId": 17842,
            "difficulty": "Hard",
            "description": "A Pit Lord commanding the final Horde base assault. His Doom ability guarantees player deaths and spawns dangerous adds. The AoE silence from Howl combined with Rain of Fire creates deadly windows where healing is impossible.",
            "phaseBreakdown": [
              "Single Phase: Tank and spank with guaranteed deaths from Doom. Off-tanks handle Lesser Doomguard adds."
            ],
            "abilities": [
              {
                "name": "Cleave",
                "spellId": 31345,
                "description": "Massive frontal cleave dealing 8,000-12,000 Physical damage to everyone in front.",
                "handling": "Only the tank in front. This cleave HURTS - it can two-shot non-tanks."
              },
              {
                "name": "Rain of Fire",
                "spellId": 31340,
                "description": "Places a Rain of Fire at a random location dealing 2,000-3,000 Fire damage per second to anyone inside. Multiple can be active at once.",
                "handling": "MOVE OUT of fire immediately. Watch your feet - the visual can be subtle. As the fight goes on, available space becomes limited."
              },
              {
                "name": "Howl of Azgalor",
                "spellId": 31344,
                "description": "Every 15-20 seconds, Azgalor howls, silencing the ENTIRE RAID for 5 seconds. No exceptions.",
                "handling": "Healers MUST pre-HoT the tank before Howl. During the 5-second silence, no one can cast anything. If the tank is low when Howl hits, they may die. Plan around the silence windows."
              },
              {
                "name": "Doom",
                "spellId": 31347,
                "description": "Marks a random player with Doom. After 20 seconds, they DIE (unavoidable). When they die, a Lesser Doomguard add spawns at their corpse.",
                "handling": "Doom CANNOT be prevented, dispelled, or immuned. The target WILL die. Warlocks should Soulstone Doomed healers. Druids can Combat Res. The Doomed player should move away from the raid before dying. Off-tank picks up the Lesser Doomguard immediately."
              },
              {
                "name": "Lesser Doomguard (Add)",
                "spellId": 0,
                "description": "Spawns when a Doomed player dies. Has moderate health and hits hard. Casts War Stomp (AoE stun).",
                "handling": "Off-tanks MUST grab these immediately. Tank them away from the raid. Kill them when possible but they're not the priority - boss is."
              }
            ],
            "strategy": "PREPARATION: Warlocks prepare Soulstones for healers. Druids save Combat Res. Mark off-tanks for add duty. POSITIONING: Tank faces boss away. Raid spreads loosely behind. DOOM: When someone gets Doom, they should move to a designated spot away from raid before dying. Off-tank picks up the add. Soulstone/Combat Res as needed. HOWL: Healers pre-HoT the tank before every Howl. The 5-second silence is predictable - plan around it. FIRE: Move out of Rain of Fire immediately.",
            "commonMistakes": [
              "Doomed players dying in the middle of the raid, add spawns on healers",
              "Not pre-HoTting tank before Howl, tank dies during silence",
              "Standing in Rain of Fire",
              "Not having off-tanks ready for Lesser Doomguard adds"
            ],
            "lootHighlights": [
              "Bow of the Unrelenting",
              "Gronnstalker's Gloves (Tier 6)",
              "Shady Dealer's Pantaloons",
              "Don Alejandro's Money Belt"
            ]
          },
          {
            "name": "Archimonde",
            "npcId": 17968,
            "difficulty": "Very Hard",
            "description": "The Defiler, lord of the Burning Legion's invasion force. Archimonde is one of the most punishing fights in TBC - a single mistake can wipe the raid. The fight demands perfect execution of Air Burst (using Tears), Doomfire kiting, and fear management. Every player death brings the raid closer to a wipe through Soul Charge.",
            "phaseBreakdown": [
              "Single Phase: Constant execution test. Manage Air Burst with Tears of the Goddess, kite Doomfire, avoid spreading Grip of the Legion, don't get feared into fire, and above all - DON'T DIE."
            ],
            "specialItem": {
              "name": "Tears of the Goddess",
              "description": "Every player receives this item from Tyrande before the fight. Using it gives a 2-minute slow fall effect. YOU MUST USE IT WHEN AIR BURSTED OR YOU DIE.",
              "macro": "/use Tears of the Goddess"
            },
            "abilities": [
              {
                "name": "Air Burst",
                "spellId": 32014,
                "description": "Targets a random player and launches them extremely high into the air. Without slow fall, the fall damage is instantly fatal.",
                "handling": "THE MOMENT you start flying upward, USE TEARS OF THE GODDESS. You have about 1 second to react. Create a macro and spam it. If you don't use Tears, you splat and die. Practice this reaction."
              },
              {
                "name": "Grip of the Legion",
                "spellId": 31972,
                "description": "Places a DoT on a random player dealing 2,500 Shadow damage every 2 seconds. The DoT JUMPS to anyone within 10 yards, spreading infinitely.",
                "handling": "SPREAD OUT 15 yards minimum from other players. If you get Grip, DO NOT run toward others. Dispel it immediately - it's a Magic debuff. If multiple people have Grip, they must separate before dispelling or it just re-spreads."
              },
              {
                "name": "Doomfire",
                "spellId": 31903,
                "description": "Spawns a fire elemental that chases a random player. The elemental leaves a trail of Doomfire on the ground that persists and deals 2,500 Fire damage per second to anyone standing in it.",
                "handling": "If you're being chased by Doomfire, KITE IT AWAY from the raid. Run in wide arcs around the edge of the battlefield. The fire trail persists for 2 minutes, slowly filling the area with deadly ground. Do NOT kite it through the raid."
              },
              {
                "name": "Fear",
                "spellId": 31970,
                "description": "Every 40 seconds, Archimonde casts an AoE fear affecting everyone within 30 yards. Lasts 8 seconds.",
                "handling": "Tremor Totems are MANDATORY - drop them constantly. Fear Ward on tanks. Warriors use Berserker Rage. Undead use Will of the Forsaken. If you get feared into Doomfire, you die. Position yourself so fear paths don't cross fire."
              },
              {
                "name": "Soul Charge",
                "spellId": 32053,
                "description": "Every time a player DIES, Archimonde gains a Soul Charge. When he has Soul Charges, he periodically unleashes them as massive AoE damage (based on the dead player's class).",
                "handling": "DO NOT DIE. Every death gives Archimonde power to wipe the raid. At 3-4 deaths, the Soul Charge explosions become unhealable. Prevent deaths at all costs."
              },
              {
                "name": "Finger of Death",
                "spellId": 31984,
                "description": "If no one is in melee range of Archimonde, he casts Finger of Death, instantly killing a random player.",
                "handling": "The tank must ALWAYS be in melee range. If the tank dies or gets feared away with no one to cover, Archimonde starts one-shotting people. Have off-tanks ready."
              }
            ],
            "strategy": "SETUP: Everyone equips Tears of the Goddess macro on an easy keybind. Spread out in a WIDE semicircle at least 15 yards apart. Tremor Totems placed throughout. EXECUTION: React instantly to Air Burst with Tears. If you get Doomfire, kite it to the edges - NEVER through the raid. Don't spread Grip of the Legion. Break fears with totems/abilities. Keep someone in melee range at ALL TIMES. MOST IMPORTANTLY: Don't die. Soul Charge snowballs - 3 deaths usually means wipe. Execute perfectly and Archimonde dies. One mistake and the raid dies.",
            "commonMistakes": [
              "Not using Tears of the Goddess when Air Bursted - instant death",
              "Kiting Doomfire through the raid instead of around the edges",
              "Standing too close to others, spreading Grip of the Legion",
              "Getting feared into Doomfire",
              "Tank leaving melee range, triggering Finger of Death",
              "Accumulating Soul Charges from player deaths"
            ],
            "lootHighlights": [
              "Tempest of Chaos",
              "Helm of the Vanquished Champion/Defender/Hero (Tier 6)",
              "Antonidas's Aegis of Rapt Concentration",
              "Leggings of Eternity",
              "Bristleblitz Striker"
            ]
          }
        ]
      },
      "black_temple": {
        "name": "Black Temple",
        "shortName": "BT",
        "size": 25,
        "location": "Shadowmoon Valley, Outland",
        "attunement": "Medallion of Karabor (requires extensive questline through Shadowmoon Valley, SSC, and TK)",
        "description": "The fortress of Illidan Stormrage and the most iconic raid in The Burning Crusade. Black Temple features 9 challenging bosses culminating in the legendary battle against Illidan himself. This raid drops the coveted Warglaives of Azzinoth and is where guilds prove their mastery of TBC raiding.",
        "recommendedComposition": {
          "tanks": 4,
          "healers": 7,
          "dps": 14,
          "notes": "Shadow Resistance gear required for Mother Shahraz. Warlock tank useful for Illidan. Multiple interrupters needed for Council. Fire Resistance helpful for Illidan demon phases."
        },
        "minimumGear": {
          "tanks": "17,000+ health unbuffed, full Tier 5/Hyjal gear, 365 Shadow Resistance (buffed) for Mother Shahraz",
          "healers": "1,800+ healing power, 11,000+ mana, Shadow Resistance set for Shahraz",
          "dps": "Full Tier 5/6 mix. Fire Resistance gear (150+) recommended for Illidan Phase 2."
        },
        "tierTokens": "Tier 6 Chest, Legs, Shoulders, Bracers, Belt, and Boots tokens drop here",
        "bosses": [
          {
            "name": "High Warlord Naj'entus",
            "npcId": 22887,
            "difficulty": "Medium",
            "description": "A massive Naga sea giant and the first boss of Black Temple. The fight revolves around the Tidal Shield mechanic - when he shields himself, a raid member must loot and throw a spine to break it before catastrophic raid damage.",
            "phaseBreakdown": [
              "Single Phase: Tank and spank with periodic Tidal Shield. When shield appears, designated player throws looted spine to break it before Tidal Burst."
            ],
            "abilities": [
              {
                "name": "Needle Spine",
                "spellId": 39992,
                "description": "Shoots spines at random raid members dealing 3,000-4,000 Physical damage. Also applies a 2,000 damage DoT that deals 2,000 Frost damage per tick.",
                "handling": "Constant raid damage that must be healed through. Keep the raid topped off at all times - Tidal Burst is coming."
              },
              {
                "name": "Impaling Spine",
                "spellId": 39837,
                "description": "Impales a random player with a large spine, rooting them and dealing 4,500 damage plus 2,750 damage every 3 seconds until removed. After 30 seconds, the spine despawns and can be looted.",
                "handling": "Heavy heal the impaled player - they take significant damage. When the spine despawns (drops on ground), the player can loot it. THIS SPINE IS NEEDED to break Tidal Shield."
              },
              {
                "name": "Tidal Shield",
                "spellId": 39872,
                "description": "Naj'entus shields himself with 100% damage immunity. While shielded, he charges Tidal Burst. Shield has ~8 seconds before Tidal Burst.",
                "handling": "A player with a looted Impaling Spine MUST throw it at Naj'entus to break the shield. Assign players to hold spines specifically for this purpose."
              },
              {
                "name": "Tidal Burst",
                "spellId": 39878,
                "description": "When Tidal Shield breaks (or times out), deals 8,500 Frost damage to the entire raid. This is unavoidable even with perfect play.",
                "handling": "Everyone must be near full health before this hits. AoE healing cooldowns (Prayer of Healing, Chain Heal spam) immediately after. If the shield wasn't broken fast enough, the damage is higher."
              }
            ],
            "strategy": "POSITIONING: Tank Naj'entus at the bottom of the ramp. Raid spreads loosely behind. SPINE ROTATION: Assign 2-3 players as 'spine holders'. When Impaling Spine hits them, they loot it after it despawns and hold it. When Tidal Shield appears, a spine holder IMMEDIATELY throws their spine at the boss. HEALING: Keep raid above 85% health at all times. Tidal Burst WILL hit - be ready with AoE heals. The fight is a healing throughput check.",
            "commonMistakes": [
              "Not having a spine ready when Tidal Shield appears",
              "Raid not topped off before Tidal Burst",
              "Impaled players not looting their spines",
              "Healers not pre-casting AoE heals for Tidal Burst"
            ],
            "lootHighlights": [
              "Fists of Mukoa",
              "Guise of the Tidal Lurker",
              "Halberd of Desolation",
              "Ring of Calming Waves"
            ]
          },
          {
            "name": "Supremus",
            "npcId": 22898,
            "difficulty": "Easy",
            "description": "A colossal Abyssal patrolling the temple grounds. Supremus alternates between a tank phase (Hateful Strike soaking) and a kite phase (random fixation). This is one of the simpler bosses in BT despite his intimidating size.",
            "phaseBreakdown": [
              "Phase 1 (Tank Phase - 60 seconds): Standard tanking with Hateful Strike. Multiple tanks soak the strike.",
              "Phase 2 (Kite Phase - 60 seconds): Supremus fixates on random players who must kite him while avoiding ground fires.",
              "Cycle: Alternates between phases until dead."
            ],
            "abilities": [
              {
                "name": "Hateful Strike",
                "spellId": 41926,
                "description": "Every 2 seconds, Supremus hits the raid member with the HIGHEST HEALTH within melee range for 20,000-30,000 Physical damage. Always targets highest HP, not highest threat.",
                "handling": "Stack 3-4 tanks in melee range. Healers keep them ALL topped off so the damage rotates between them. If only one tank is high HP, they take every strike and die."
              },
              {
                "name": "Molten Punch",
                "spellId": 40126,
                "description": "Creates a line of fire on the ground that persists and deals heavy Fire damage to anyone standing in it.",
                "handling": "Simply don't stand in fire. Watch your feet during Phase 1."
              },
              {
                "name": "Volcanic Geyser",
                "spellId": 42055,
                "description": "Phase 2 only. Blue flame volcanoes spawn under random players, dealing Fire damage and knocking them back.",
                "handling": "Keep moving during Phase 2. Standing still spawns geysers under you. Constant movement prevents damage."
              },
              {
                "name": "Gaze (Fixate)",
                "spellId": 41951,
                "description": "Phase 2 only. Supremus fixates on a random player and chases them for 10 seconds. He moves slowly but kills anyone he reaches.",
                "handling": "If you get Gaze, RUN AWAY. Kite him around the courtyard. He's slow - just keep moving. After 10 seconds, he picks a new target."
              },
              {
                "name": "Molten Flame",
                "spellId": 40253,
                "description": "Phase 2 only. Supremus leaves a trail of fire as he chases his Gaze target.",
                "handling": "Don't run through his fire trail. Kite in wide arcs, not circles."
              }
            ],
            "strategy": "PHASE 1: 3-4 tanks stack in melee range. Healers keep ALL tanks topped off - Hateful Strike always hits highest HP. Melee DPS behind the boss. Avoid fire lines. PHASE 2: Everyone spreads out and keeps moving. When Supremus Gazes you, kite him in wide arcs. Don't stand still or geysers spawn under you. Continue DPS while moving. After 60 seconds, return to Phase 1 positions. REPEAT until dead.",
            "commonMistakes": [
              "Only one tank in melee during Phase 1 - they die",
              "Standing still during Phase 2 - geysers spawn",
              "Kiting Gaze through the raid - fire trail kills people",
              "Running straight away from Gaze instead of wide arcs"
            ],
            "lootHighlights": [
              "Naj'entus Breastplate",
              "Syphon of the Nathrezim",
              "Waistwrap of Infinity",
              "Band of the Abyssal Lord"
            ]
          },
          {
            "name": "Shade of Akama",
            "npcId": 22841,
            "difficulty": "Medium",
            "description": "Akama, the Broken elder, must free himself from his corrupted shade. This is an add-management fight where you defend Akama while he channels to break free. If Akama dies, you wipe.",
            "phaseBreakdown": [
              "Phase 1 (Add Phase): Endless waves of Ashtongue adds spawn. Kill them while Akama channels toward the Shade.",
              "Phase 2 (Burn Phase): When Akama reaches the Shade, all remaining adds despawn. Burn the Shade down."
            ],
            "abilities": [
              {
                "name": "Ashtongue Channeler",
                "spellId": 0,
                "description": "6 Channelers surround the Shade, keeping it immune. They channel until killed.",
                "handling": "Kill all 6 Channelers FIRST before engaging the Shade. They don't fight back - just focus them down to start the encounter."
              },
              {
                "name": "Ashtongue Defender",
                "spellId": 0,
                "description": "Melee adds that spawn from the sides. They attack Akama, not the raid.",
                "handling": "Tanks pick these up and hold them off Akama. Don't let them hit Akama or he dies."
              },
              {
                "name": "Ashtongue Elementalist",
                "spellId": 0,
                "description": "Caster adds that spawn. Cast Rain of Fire and Frost Shock.",
                "handling": "Interrupt Rain of Fire - it does heavy damage. Kill these quickly."
              },
              {
                "name": "Ashtongue Rogue",
                "spellId": 0,
                "description": "Stealthed adds that spawn and attack random raid members with Debilitating Poison.",
                "handling": "AoE to break stealth. Dispel the poison."
              },
              {
                "name": "Ashtongue Spiritbinder",
                "spellId": 0,
                "description": "Healer adds that spawn. Cast Chain Heal on other adds and Spirit Mend on the Shade.",
                "handling": "KILL THESE FIRST or interrupt their heals. Top priority adds."
              }
            ],
            "strategy": "SETUP: Kill the 6 Channelers to start the encounter. Akama begins walking toward the Shade. ADD MANAGEMENT: Tanks position at add spawn points. Kill order: Spiritbinders > Elementalists > Rogues > Defenders. Protect Akama at all costs. PHASE 2: When Akama reaches the Shade, remaining adds despawn. Pop cooldowns and burn the Shade. It has moderate health and goes down fast if adds are managed properly.",
            "commonMistakes": [
              "Letting adds reach Akama - he dies, you wipe",
              "Not interrupting Spiritbinder heals - fight takes forever",
              "Ignoring Elementalist Rain of Fire",
              "Not having tanks ready at spawn points"
            ],
            "lootHighlights": [
              "Amice of Brilliant Light",
              "Shadow-walker's Cord",
              "Focused Mana Bindings",
              "Ring of Deceitful Intent"
            ]
          },
          {
            "name": "Teron Gorefiend",
            "npcId": 22871,
            "difficulty": "Hard",
            "description": "The first Death Knight of the Horde, raised by Gul'dan. This fight features a unique mechanic: players marked with Shadow of Death will die and become ghosts. As ghosts, they must use special abilities to kill Shadowy Constructs before they reach the raid. One failed ghost player can wipe the entire raid.",
            "ghostAbilities": {
              "description": "When you die from Shadow of Death, you become a ghost for 60 seconds with 4 abilities:",
              "abilities": [
                "Spirit Lance (1): Deals 15,000 damage. Use on cooldown.",
                "Spirit Chains (2): Roots a Construct for 5 seconds. Use to control adds.",
                "Spirit Shield (3): Absorbs 50,000 damage for 30 seconds. Use on raid members.",
                "Spirit Volley (4): AoE damage. Use when multiple Constructs are stacked."
              ],
              "practice": "IMPORTANT: Practice the ghost minigame at htttps://www.yourgamercards.net/teron/ before attempting this boss!"
            },
            "abilities": [
              {
                "name": "Shadow of Death",
                "spellId": 40251,
                "description": "Marks a random player. After 55 seconds, they DIE and become a ghost. They then control their ghost form for 60 seconds.",
                "handling": "When you get Shadow of Death, mentally prepare. In 55 seconds you will die and become a ghost. As a ghost, you MUST kill the Shadowy Constructs that spawn. If constructs reach the raid, people die."
              },
              {
                "name": "Shadowy Constructs",
                "spellId": 0,
                "description": "When a player dies from Shadow of Death, 4 Shadowy Constructs spawn at their corpse. These constructs walk toward the raid and one-shot anyone they touch.",
                "handling": "GHOST PLAYERS must kill these using their ghost abilities. Use Spirit Lance for damage, Spirit Chains to root them, Spirit Volley for AoE. If constructs reach the raid, multiple people die."
              },
              {
                "name": "Incinerate",
                "spellId": 40239,
                "description": "Deals 3,000-5,000 Fire damage to a random player.",
                "handling": "Random damage that healers must react to. Keep raid topped off."
              },
              {
                "name": "Crushing Shadows",
                "spellId": 40243,
                "description": "Debuff increasing Shadow damage taken by 60% for 15 seconds.",
                "handling": "DISPEL IMMEDIATELY. Players with this debuff take much more damage from Doom Blossom."
              },
              {
                "name": "Doom Blossom",
                "spellId": 40188,
                "description": "Spawns shadow flowers around the room that shoot Shadow Bolt at random players for 750 Shadow damage each.",
                "handling": "Move away from flowers. The bolts hurt, especially with Crushing Shadows debuff."
              }
            ],
            "strategy": "PREPARATION: Everyone should practice the ghost minigame before raiding. POSITIONING: Tank Gorefiend in the center. Raid spreads loosely. EXECUTION: Tank and spank normally. When you get Shadow of Death, move to a designated 'death spot' away from the raid. When you die and become a ghost, IMMEDIATELY start killing Shadowy Constructs using your ghost abilities. Root them with Chains, damage with Lance and Volley. Do NOT let constructs reach living players. After 60 seconds of ghost form, you resurrect. REPEAT until boss dies.",
            "commonMistakes": [
              "Not practicing the ghost minigame - players fail their ghost phase",
              "Ghost players letting constructs reach the raid",
              "Not dispelling Crushing Shadows",
              "Dying in the middle of the raid instead of a designated spot"
            ],
            "lootHighlights": [
              "Shadowmoon Destroyer's Drape",
              "Pauldrons of the Wardancer",
              "Rifle of the Stoic Guardian",
              "Soul Cleaver"
            ]
          },
          {
            "name": "Gurtogg Bloodboil",
            "npcId": 22948,
            "difficulty": "Hard",
            "description": "A massive Fel Orc warlock. This fight requires precise positioning with three raid groups rotating to soak Bloodboil stacks, tank swaps for Acidic Wound, and emergency tanking for Fel Rage. One of the more coordination-heavy fights in BT.",
            "phaseBreakdown": [
              "Phase 1 (Normal): Tank and spank with Bloodboil group rotation and tank swaps.",
              "Phase 2 (Fel Rage): Random player becomes Gurtogg's target for 30 seconds. They become the 'tank'."
            ],
            "abilities": [
              {
                "name": "Bloodboil",
                "spellId": 42005,
                "description": "Every 10 seconds, Gurtogg hits the 5 CLOSEST players with a stacking DoT dealing 600 damage per stack every 2 seconds. Stacks up to 5 times.",
                "handling": "Split raid into 3 groups. Groups ROTATE being the closest 5 players. Group 1 soaks, then Group 2, then Group 3, then back to Group 1. This spreads the stacks so no one dies."
              },
              {
                "name": "Acidic Wound",
                "spellId": 40484,
                "description": "Stacking debuff reducing the tank's armor by 500 per stack and dealing damage over time. Stacks indefinitely.",
                "handling": "Tank swap at 10-12 stacks. Two tanks rotate. At high stacks, the tank takes massive damage."
              },
              {
                "name": "Arcing Smash",
                "spellId": 40599,
                "description": "Frontal cone attack dealing 7,500-10,000 Physical damage and knocking back anyone hit.",
                "handling": "Only tanks should be in front. Melee behind, ranged spread."
              },
              {
                "name": "Fel Rage",
                "spellId": 40604,
                "description": "Every 60 seconds, Gurtogg targets a random player and fixates on them for 30 seconds. That player gains 10,000 HP, 300% armor, and 100% damage increase, but Gurtogg only attacks them.",
                "handling": "If you get Fel Rage, you ARE the tank for 30 seconds. Run to the tank spot, face Gurtogg away from raid. Healers SPAM HEAL the Fel Rage target. They can take it but need heavy healing."
              },
              {
                "name": "Insignificance",
                "spellId": 40618,
                "description": "During Fel Rage, Gurtogg applies this to the normal tanks, reducing their threat to 0.",
                "handling": "Tanks cannot taunt during Fel Rage. The Fel Rage target MUST tank."
              }
            ],
            "strategy": "SETUP: Split raid into 3 groups (melee, ranged 1, ranged 2). Mark positions for each group's 'close' rotation. BLOODBOIL ROTATION: Group 1 stands closest for first Bloodboil, then moves away. Group 2 moves close for second, then Group 3. Rotate so stacks spread evenly. TANK SWAPS: Swap tanks at 10-12 Acidic Wound stacks. FEL RAGE: When it triggers, the target becomes the tank. They run to tank position. All healers focus them. After 30 seconds, normal tanking resumes. Continue rotation.",
            "commonMistakes": [
              "Groups not rotating properly, stacks accumulate on one group",
              "Not swapping tanks, Acidic Wound stacks kill the tank",
              "Fel Rage target panicking instead of tanking",
              "Healers not focusing the Fel Rage target"
            ],
            "lootHighlights": [
              "Girdle of Mighty Resolve",
              "Girdle of the Lightbearer",
              "Vest of Mounting Assault",
              "Staff of Immaculate Recovery"
            ]
          },
          {
            "name": "Reliquary of Souls",
            "npcId": 22856,
            "difficulty": "Hard",
            "description": "A massive reliquary containing three essences: Suffering, Desire, and Anger. Each essence has completely different mechanics, making this a three-boss fight in one. Phase 1 prohibits healing. Phase 2 punishes high DPS. Phase 3 is a pure burn race.",
            "phaseBreakdown": [
              "Phase 1 (Essence of Suffering): ALL HEALING IS NEGATED. DPS race to kill it before raid dies.",
              "Intermission: Adds spawn. Kill them before Phase 2.",
              "Phase 2 (Essence of Desire): 50% of YOUR DAMAGE heals the boss. Controlled DPS required. Interrupt Spirit Shock.",
              "Intermission: More adds. Kill them.",
              "Phase 3 (Essence of Anger): Burn phase. Boss deals increasing damage. Kill it fast."
            ],
            "abilities": [
              {
                "name": "Aura of Suffering",
                "spellId": 41292,
                "description": "Phase 1 aura. REDUCES ALL HEALING TO ZERO. Also drains 50 HP per second from everyone.",
                "handling": "You CANNOT heal. Everyone slowly dies. Just DPS as fast as possible to kill the Essence before everyone dies. Warlocks can Life Tap for mana since healing is useless anyway."
              },
              {
                "name": "Frenzy (Phase 1)",
                "spellId": 41305,
                "description": "At 65% HP, Essence of Suffering enrages, dealing more damage.",
                "handling": "Push through it. You're racing the clock anyway."
              },
              {
                "name": "Soul Drain",
                "spellId": 41303,
                "description": "Phase 1. Channels on random players, dealing Shadow damage.",
                "handling": "Cannot be avoided. Just heal after Phase 1 ends."
              },
              {
                "name": "Aura of Desire",
                "spellId": 41350,
                "description": "Phase 2 aura. 50% of all damage dealt by players HEALS the Essence of Desire.",
                "handling": "CONTROLLED DPS. If you go too fast, you heal the boss more than you damage it. Stop DoTs. Use slow, steady damage. Make sure healing output exceeds boss healing."
              },
              {
                "name": "Spirit Shock",
                "spellId": 41426,
                "description": "Phase 2. 2.5-second cast dealing 9,000 Nature damage to a random player. Interruptible.",
                "handling": "MUST BE INTERRUPTED. Set up an interrupt rotation. If it goes off, it can one-shot people."
              },
              {
                "name": "Deaden",
                "spellId": 41410,
                "description": "Phase 2. Reduces a player's damage by 100% for 10 seconds.",
                "handling": "Just wait it out. One less person DPSing actually helps in Phase 2."
              },
              {
                "name": "Aura of Anger",
                "spellId": 41337,
                "description": "Phase 3 aura. Boss deals increasing damage over time. Raid takes more damage the longer the phase goes.",
                "handling": "This is why Phase 3 is a burn race. The longer it goes, the harder it hits."
              },
              {
                "name": "Soul Scream",
                "spellId": 41545,
                "description": "Phase 3. AoE Shadow damage and mana drain.",
                "handling": "Heal through it. Use mana potions."
              },
              {
                "name": "Spite",
                "spellId": 41376,
                "description": "Phase 3. Targets 3 random players, dealing 7,500 damage and stunning them for 6 seconds.",
                "handling": "Unavoidable. Healers must react to stun targets."
              }
            ],
            "strategy": "PHASE 1: ALL OUT DPS. Healing is impossible - just burn the Essence of Suffering down before everyone dies. It's a race. INTERMISSION: Kill the adds that spawn. PHASE 2: CONTROLLED DPS. Your damage heals the boss. Interrupt every Spirit Shock with a rotation. Slow, steady damage while healers keep up. INTERMISSION: Kill adds again. PHASE 3: HEROISM/BLOODLUST. Full burn. Boss deals increasing damage - kill it before it kills you. Heal through Soul Scream and Spite.",
            "commonMistakes": [
              "Not DPSing hard enough in Phase 1 - raid dies",
              "DPSing too hard in Phase 2 - healing the boss more than damaging",
              "Missing Spirit Shock interrupts in Phase 2",
              "Not bursting hard enough in Phase 3 - damage overwhelms healers"
            ],
            "lootHighlights": [
              "Naaru-Blessed Life Rod",
              "Torch of the Damned",
              "Translucent Spellthread Necklace",
              "Grips of Damnation"
            ]
          },
          {
            "name": "Mother Shahraz",
            "npcId": 22947,
            "difficulty": "Hard",
            "description": "A Shivarra priestess of the Burning Legion. This fight requires Shadow Resistance gear (minimum 270 SR) on the entire raid to survive. The main mechanics are Saber Lash (requiring 3 tanks stacked) and Fatal Attraction (teleporting players together).",
            "gearRequirement": {
              "shadowResist": "270 minimum Shadow Resistance for all raid members",
              "sources": "Shadowcloth tailoring, Hearts of Darkness crafted gear, SR enchants"
            },
            "abilities": [
              {
                "name": "Saber Lash",
                "spellId": 40810,
                "description": "Every 2 seconds, Shahraz cleaves the 3 closest targets in front of her for 10,000-14,000 Physical damage SPLIT between them.",
                "handling": "THREE TANKS must stack directly in front of Shahraz at all times. They split the damage three ways. With only 2 tanks, they die. With only 1, instant death."
              },
              {
                "name": "Fatal Attraction",
                "spellId": 40869,
                "description": "Teleports 3 random players to the same location. While together, they deal 1,500 Shadow damage per second to each other. Lasts until they spread apart.",
                "handling": "If you get teleported, IMMEDIATELY run away from the other two players. The longer you stay together, the more damage you take. Spread to at least 10 yards apart."
              },
              {
                "name": "Prismatic Aura",
                "spellId": 40880,
                "description": "Shahraz cycles through different resistance auras every 15 seconds, increasing her resistance to one school while decreasing resistance to others.",
                "handling": "This affects DPS depending on their damage school. Shadow Priests suffer during Shadow aura. Can't control it - just adapt."
              },
              {
                "name": "Silencing Shriek",
                "spellId": 40823,
                "description": "AoE silence hitting everyone in front of Shahraz (100-yard range, frontal cone).",
                "handling": "ONLY tanks should be in front. Healers and ranged DPS position BEHIND Shahraz to avoid the silence."
              },
              {
                "name": "Beam Abilities",
                "spellId": 40863,
                "description": "Shahraz periodically casts various beam attacks: Sinful Beam (Shadow), Sinister Beam (Shadow), Vile Beam (Shadow), Wicked Beam (Shadow).",
                "handling": "This is why SR gear is required. Without it, beams deal 10,000+ damage. With SR, they're manageable."
              }
            ],
            "strategy": "POSITIONING: 3 tanks stack DIRECTLY in front of Shahraz. Everyone else positions BEHIND her to avoid Silencing Shriek. SR GEAR: Everyone must have 270+ Shadow Resistance. EXECUTION: Tanks split Saber Lash. When Fatal Attraction triggers, teleported players IMMEDIATELY spread apart. Healers keep tanks and Fatal Attraction targets alive. DPS burns. Simple execution once SR gear is obtained.",
            "commonMistakes": [
              "Not having 3 tanks in front - Saber Lash kills them",
              "Not having Shadow Resistance gear - beams one-shot people",
              "Teleported players not spreading from Fatal Attraction",
              "Healers/ranged standing in front and getting silenced"
            ],
            "lootHighlights": [
              "Leggings of Devastation",
              "Heartshatter Breastplate",
              "Tome of the Lightbringer",
              "Blade of Savagery"
            ]
          },
          {
            "name": "The Illidari Council",
            "npcId": 23426,
            "difficulty": "Very Hard",
            "description": "Four of Illidan's most trusted lieutenants fighting simultaneously: Gathios the Shatterer (Paladin), High Nethermancer Zerevor (Mage), Lady Malande (Priest), and Veras Darkshadow (Rogue). All four share a health pool and must die within 15 seconds of each other, or survivors resurrect dead members.",
            "councilMembers": [
              {
                "name": "Gathios the Shatterer",
                "role": "Paladin - Physical Tank",
                "abilities": "Consecration, Seal of Blood, Hammer of Justice, Blessing of Protection (makes self immune to Physical), Judgement. Melee boss.",
                "strategy": "Standard tank. Tank away from the others. When he casts Blessing of Protection on himself, casters DPS him instead of physical."
              },
              {
                "name": "High Nethermancer Zerevor",
                "role": "Mage - Caster Tank Required",
                "abilities": "Arcane Bolt (7,500 damage), Blizzard, Flamestrike, Dampen Magic, Arcane Explosion if anyone is in melee range.",
                "strategy": "CANNOT be tanked traditionally - casts Arcane Explosion in melee. Use a Warlock tank with high Arcane/Shadow Resistance or a Mage using Spellsteal for Dampen Magic. Stand at range."
              },
              {
                "name": "Lady Malande",
                "role": "Priest - KILL PRIORITY",
                "abilities": "Circle of Healing (heals ALL council members), Divine Wrath (large AoE), Reflective Shield (reflects damage).",
                "strategy": "INTERRUPT CIRCLE OF HEALING. This is the TOP PRIORITY of the entire fight. If she heals, you lose. When Reflective Shield is up, stop DPS on her briefly."
              },
              {
                "name": "Veras Darkshadow",
                "role": "Rogue - Mobile DPS Target",
                "abilities": "Deadly Poison (stacking), Vanish, Envenom. Vanishes and reappears on random targets.",
                "strategy": "Tank when visible. When he vanishes, he'll appear on a random player - be ready to pick him back up. Dispel Deadly Poison stacks."
              }
            ],
            "sharedHealthPool": "All four council members share a health pool. Damage to any of them counts toward the total. When total HP reaches 0, all four must die within 15 seconds or survivors resurrect dead members at full health.",
            "abilities": [
              {
                "name": "Circle of Healing",
                "spellId": 41455,
                "description": "Lady Malande heals ALL council members for 80,000-100,000 HP.",
                "handling": "INTERRUPT THIS EVERY TIME. Assign 3-4 interrupters to Malande with a rotation. Missing one Circle of Healing can reset minutes of progress."
              },
              {
                "name": "Blessing of Spell Warding",
                "spellId": 41451,
                "description": "Gathios casts this on a random council member, making them immune to spell damage for 15 seconds.",
                "handling": "Physical DPS switches to the buffed target. Casters wait or DPS other targets."
              },
              {
                "name": "Blessing of Protection",
                "spellId": 41450,
                "description": "Gathios casts this on himself, making him immune to physical damage for 15 seconds.",
                "handling": "Physical DPS switches targets. Casters focus Gathios during this window."
              },
              {
                "name": "Divine Wrath",
                "spellId": 41472,
                "description": "Lady Malande deals 3,000-4,000 Holy damage to random raid members.",
                "handling": "Heal through it. Unavoidable but manageable."
              },
              {
                "name": "Reflective Shield",
                "spellId": 41475,
                "description": "Zerevor shields himself, reflecting 25% of damage back to attackers.",
                "handling": "Stop DPSing Zerevor when shield is up. Switch to another target."
              }
            ],
            "strategy": "SETUP: Gathios tanked normally in one spot. Zerevor tanked by Warlock/Mage at range in another spot. Malande tanked at range by another caster. Veras picked up wherever he appears. EXECUTION: 3-4 interrupters are DEDICATED to Lady Malande - interrupt every Circle of Healing. Everyone else DPSes. When Blessing of Protection/Spell Warding goes out, switch targets appropriately. Balance DPS so all four die around the same time. At low HP, coordinate the final burn so all four die within 15 seconds.",
            "commonMistakes": [
              "Missing Circle of Healing interrupts - fight resets",
              "Trying to melee tank Zerevor - Arcane Explosion kills you",
              "Not coordinating final kills - one resurrects and resets the fight",
              "Not switching targets during immunity blessings"
            ],
            "lootHighlights": [
              "Forest Prowler's Helm",
              "Madness of the Betrayer",
              "Veil of Turning Leaves",
              "Helm of the Illidari Shatterer"
            ]
          },
          {
            "name": "Illidan Stormrage",
            "npcId": 22917,
            "difficulty": "Very Hard",
            "description": "The Betrayer himself. This legendary encounter spans 5 phases over 15-20 minutes and is the pinnacle of TBC raiding. Illidan demands mastery of tank mechanics (Shear immunity), add control (Flames of Azzinoth, Parasites), and raid positioning (Demon Form). Defeating Illidan is a crowning achievement.",
            "phaseBreakdown": [
              "Phase 1 (100%-65%): Tank and spank with Parasites and Flame Crash. Tank must be Shear-immune.",
              "Phase 2 (65%): Illidan flies up and spawns 2 Flames of Azzinoth. Kill both while avoiding Eye Beam.",
              "Phase 3 (65%-30%): Returns to Phase 1 mechanics plus periodic Demon Form transitions.",
              "Phase 4 (30%): Maiev Shadowsong joins. Illidan is periodically trapped. Burn phase.",
              "Demon Form (Throughout Phase 3+): Every 60 seconds, Illidan transforms. Raid must spread to avoid Shadow Demons."
            ],
            "tankRequirement": {
              "shear": "The tank MUST be immune to Shear or they die. Warriors maintain Shield Block 100% of the time. Shield Block absorbs Shear completely. If Shield Block falls off, Shear hits and the tank dies.",
              "fireResist": "During Demon Form, Fire Resistance helps (365 FR cap)."
            },
            "abilities": [
              {
                "name": "Shear",
                "spellId": 41032,
                "description": "Every 10 seconds, Illidan casts Shear, reducing the tank's maximum HP by 60% for 7 seconds. If the tank is not Block/Dodge/Parry immune to this, they effectively have 40% HP and will die.",
                "handling": "Warrior tank with Shield Block up at ALL TIMES. Shield Block makes Shear miss. If Shield Block is down when Shear is cast, the tank dies. This is the fundamental tank check of the encounter."
              },
              {
                "name": "Draw Soul",
                "spellId": 40904,
                "description": "Frontal cone that deals damage and heals Illidan if the target dies during the channel.",
                "handling": "Tank faces Illidan away. Keep tank alive during Draw Soul."
              },
              {
                "name": "Parasitic Shadowfiend",
                "spellId": 41917,
                "description": "Spawns a parasite on a random player. If not killed within 10 seconds, it multiplies into 2 parasites. Each multiplication doubles the count.",
                "handling": "KILL PARASITES IMMEDIATELY. Assign DPS to instantly switch and kill them. If they multiply more than once, you wipe to exponential parasite growth."
              },
              {
                "name": "Flame Crash",
                "spellId": 40832,
                "description": "Creates a fire zone on the ground dealing heavy Fire damage to anyone standing in it.",
                "handling": "Move out of fire. Keep the area clear for positioning."
              },
              {
                "name": "Flames of Azzinoth",
                "spellId": 40029,
                "description": "Phase 2: Illidan throws his Warglaives, spawning 2 Flames of Azzinoth adds. Each has 1M HP and deals heavy Fire damage.",
                "handling": "Two tanks pick up one Flame each. Tank them apart. DPS burns both down. When both die, Phase 3 begins."
              },
              {
                "name": "Eye Beam",
                "spellId": 39908,
                "description": "Phase 2: Illidan hovers and fires a beam that tracks players. Deals 20,000+ Fire damage per second.",
                "handling": "Run PERPENDICULAR to the beam direction. The beam tracks slowly - you can outrun it by moving sideways. Don't run directly away."
              },
              {
                "name": "Dark Barrage",
                "spellId": 40585,
                "description": "Phase 2: Channels Shadow damage at a random player for 10 seconds.",
                "handling": "All healers focus the Dark Barrage target. They take massive sustained damage."
              },
              {
                "name": "Demon Form",
                "spellId": 40506,
                "description": "Phase 3+: Every 60 seconds, Illidan transforms into Demon Form for 60 seconds. Different abilities active.",
                "handling": "During Demon Form, raid spreads out. Tank positions change. See Demon Form abilities below."
              },
              {
                "name": "Shadow Blast (Demon Form)",
                "spellId": 41078,
                "description": "Demon Form tank attack dealing 10,000 Shadow damage.",
                "handling": "Warlock or high-FR tank can take over during Demon Form. Or original tank with FR gear."
              },
              {
                "name": "Flame Burst (Demon Form)",
                "spellId": 41131,
                "description": "Demon Form: Deals 3,500 Fire damage to random players.",
                "handling": "Heal through it. Unavoidable."
              },
              {
                "name": "Shadow Demons (Demon Form)",
                "spellId": 41117,
                "description": "Demon Form: Spawns 4 Shadow Demons that fixate on random players. If they reach their target, they paralyze them and deal lethal damage.",
                "handling": "KILL SHADOW DEMONS IMMEDIATELY. They're low HP but must die before reaching their targets. Assign DPS to them."
              },
              {
                "name": "Agonizing Flames (Demon Form)",
                "spellId": 40932,
                "description": "Demon Form: Massive Fire AoE centered on Illidan. Everyone within 25 yards takes 4,000+ Fire damage per second.",
                "handling": "SPREAD OUT during Demon Form. Everyone must be at least 25 yards from Illidan. Pre-assigned positions help."
              },
              {
                "name": "Maiev's Aid (Phase 4)",
                "spellId": 40409,
                "description": "At 30%, Maiev Shadowsong arrives. She periodically traps Illidan with Cage of Shadows, stunning him for 15 seconds.",
                "handling": "When Illidan is trapped, he takes 100% increased damage. Pop all remaining cooldowns and BURN."
              }
            ],
            "strategy": "PHASE 1: Warrior tank maintains Shield Block 100%. Kill Parasites immediately. Move from Flame Crash. PHASE 2: Two tanks grab Flames of Azzinoth. Raid burns them while avoiding Eye Beam (run perpendicular). Heal Dark Barrage target. PHASE 3: Back to Phase 1 mechanics but with Demon Form every 60 seconds. During Demon Form, everyone spreads 25+ yards from Illidan. Kill Shadow Demons instantly. Return to normal positions after. PHASE 4 (30%): Maiev joins. When Illidan is trapped, pop Heroism/Bloodlust and all cooldowns. Maximum burn. Continue handling Demon Form transitions until dead.",
            "commonMistakes": [
              "Tank losing Shield Block and dying to Shear",
              "Not killing Parasites immediately - exponential multiplication wipes raid",
              "Getting hit by Eye Beam in Phase 2",
              "Not spreading during Demon Form - Agonizing Flames kills melee",
              "Shadow Demons reaching their targets",
              "Not bursting during Maiev's trap windows"
            ],
            "lootHighlights": [
              "Warglaive of Azzinoth (Main Hand) - Legendary",
              "Warglaive of Azzinoth (Off Hand) - Legendary",
              "Chestguard of the Vanquished Champion/Defender/Hero (Tier 6)",
              "Bulwark of Azzinoth",
              "Zhar'doom, Greatstaff of the Devourer",
              "Black Bow of the Betrayer"
            ]
          }
        ]
      }
    }
  },
  "phase4": {
    "name": "Phase 4: Zul'Aman",
    "description": "A 10-player timed raid set in the troll city of Zul'Aman. Features the legendary 'bear run' timed event for the Amani War Bear mount.",
    "raids": {
      "zulaman": {
        "name": "Zul'Aman",
        "shortName": "ZA",
        "size": 10,
        "location": "Ghostlands, Eastern Kingdoms",
        "attunement": "None required",
        "description": "A challenging 10-player troll raid featuring the legendary timed 'bear run' event. When you first speak to Harrison Jones at the entrance, a 45-minute timer begins. Saving all 4 prisoners before their respective bosses die awards the Amani War Bear mount to one player. This raid drops excellent catch-up gear equivalent to T5/early T6.",
        "bearRunInfo": {
          "timer": "45 minutes from engaging Harrison Jones",
          "prisoners": "4 prisoners to rescue: one before each of the first 4 bosses",
          "reward": "Amani War Bear mount (one per run) if all 4 prisoners are saved",
          "strategy": "Skip unnecessary trash, use drums/heroism efficiently, have fast clear times on each boss"
        },
        "recommendedComposition": {
          "tanks": 2,
          "healers": 3,
          "dps": 5,
          "notes": "Bring strong AoE (Mages, Warlocks) for Jan'alai eggs. Shamans provide Heroism for faster bear runs. Hunter Misdirection helps with Hex Lord adds. Paladins excellent for bear run tank threat. Priests useful for dispels on Hex Lord."
        },
        "minimumGear": {
          "tanks": "16,000+ health unbuffed, 490 Defense, mix of Tier 5/6 or Badge gear",
          "healers": "1,600+ healing power, 10,000+ mana",
          "dps": "Tier 5 equivalent or better. Bear runs require significantly higher DPS output."
        },
        "tierTokens": "No tier tokens - drops unique high-ilvl gear and Badges of Justice",
        "bosses": [
          {
            "name": "Akil'zon",
            "npcId": 23574,
            "difficulty": "Medium",
            "description": "The Eagle Avatar of Zul'Aman. First boss of the bear run timer. The Electrical Storm mechanic is the key to this fight - failing to collapse under the floating player means death.",
            "bearRunTimer": "First prisoner - save before killing Akil'zon",
            "phaseBreakdown": [
              "Single Phase: Tank and spank with periodic Electrical Storm. Collapse under floating player during storm, spread out otherwise."
            ],
            "abilities": [
              {
                "name": "Static Disruption",
                "spellId": 43622,
                "description": "Places a debuff on a random player increasing Nature damage taken by 25% for 20 seconds. Jumps to nearby players within 12 yards.",
                "handling": "SPREAD OUT at least 12 yards to prevent chaining. This debuff makes Electrical Storm more dangerous."
              },
              {
                "name": "Gust of Wind",
                "spellId": 43621,
                "description": "Knocks a random player back a significant distance.",
                "handling": "Position away from platform edges. Getting knocked off requires running back up and wastes time."
              },
              {
                "name": "Electrical Storm",
                "spellId": 43648,
                "description": "Every 60 seconds, a random player is lifted into the air and an electrical storm forms. Anyone NOT directly under the floating player takes 3,500 Nature damage per second for 8 seconds.",
                "handling": "THE MOMENT someone floats up, EVERYONE sprints directly under them. Stack tightly beneath the floating player. After 8 seconds, immediately spread out again to avoid Static Disruption chains."
              },
              {
                "name": "Call Lightning",
                "spellId": 43661,
                "description": "Lightning bolt dealing 3,500-4,500 Nature damage to a random player.",
                "handling": "Unavoidable random damage. Healers keep everyone healthy."
              },
              {
                "name": "Amani Eagle Adds",
                "spellId": 0,
                "description": "Eagle adds periodically swoop down and attack random players.",
                "handling": "AoE them down. They have low HP but are annoying if ignored."
              }
            ],
            "strategy": "POSITIONING: Spread out in a loose circle around the boss, at least 12 yards apart. Tank holds boss in center. ELECTRICAL STORM: When someone floats up, EVERYONE runs under them immediately. You have about 2 seconds to get there. Stack tightly, then spread back out after the storm ends. BEAR RUN: Save the prisoner BEFORE engaging the boss. Clear quickly - this is an easy boss mechanically.",
            "commonMistakes": [
              "Not collapsing under the floating player during Electrical Storm",
              "Standing too close and chaining Static Disruption",
              "Getting knocked off the platform by Gust of Wind"
            ],
            "lootHighlights": [
              "Signet of Ancient Magics",
              "Akil'zon's Talonblade",
              "Mojo-mender's Mask",
              "Amani Punisher"
            ]
          },
          {
            "name": "Nalorakk",
            "npcId": 23576,
            "difficulty": "Easy",
            "description": "The Bear Avatar of Zul'Aman. Second bear run boss. Alternates between Troll Form (two tanks split damage) and Bear Form (heavy bleed on main tank). The easiest boss in ZA.",
            "bearRunTimer": "Second prisoner - save before killing Nalorakk",
            "phaseBreakdown": [
              "Troll Form: Two tanks split Brutal Swipe in front of boss.",
              "Bear Form: Single tank, heavy healing required for Mangle bleed.",
              "Cycle: Alternates every 45 seconds."
            ],
            "abilities": [
              {
                "name": "Brutal Swipe",
                "spellId": 42384,
                "description": "Troll Form only. Deals 14,000-18,000 Physical damage split between the two closest targets in front of Nalorakk.",
                "handling": "TWO TANKS must stack directly in front of Nalorakk during Troll Form. They split the damage, taking 7,000-9,000 each. With only one tank, it's likely fatal."
              },
              {
                "name": "Mangle",
                "spellId": 42389,
                "description": "Bear Form only. Applies a stacking bleed to the tank dealing 1,735 damage every 2 seconds for 30 seconds. Stacks.",
                "handling": "Heavy healing on the tank during Bear Form. The bleed stacks if he doesn't switch back to Troll Form. Use tank cooldowns during Bear Form."
              },
              {
                "name": "Surge",
                "spellId": 42402,
                "description": "Bear Form only. Charges a random player, dealing moderate damage and briefly stunning them.",
                "handling": "Healers be ready to heal the charge target. Not usually deadly."
              },
              {
                "name": "Deafening Roar",
                "spellId": 42398,
                "description": "Bear Form only. AoE roar that silences the entire raid for 2 seconds.",
                "handling": "Pre-HoT the tank before Bear Form. The silence prevents casting during a critical healing phase."
              },
              {
                "name": "Lacerating Slash",
                "spellId": 42395,
                "description": "Bear Form only. Additional bleed on the tank.",
                "handling": "More healing required. Stack with Mangle for heavy tank damage."
              }
            ],
            "strategy": "TROLL FORM: Two tanks stack in front, everyone else behind. Tanks split Brutal Swipe. DPS burns. BEAR FORM: Only main tank in front. Healers focus the tank heavily - Mangle stacks hurt. Pre-HoT before Deafening Roar silences you. DPS continues. REPEAT: Forms alternate every 45 seconds. Very simple once you understand the pattern.",
            "commonMistakes": [
              "Only one tank in front during Troll Form - they die to Brutal Swipe",
              "Not pre-healing the tank before Deafening Roar silence",
              "Healers not focusing tank during Bear Form bleed stacks"
            ],
            "lootHighlights": [
              "Jungle Stompers",
              "Fury of the Ursine",
              "Robes of Heavenly Purpose",
              "Pauldrons of Primal Fury"
            ]
          },
          {
            "name": "Jan'alai",
            "npcId": 23578,
            "difficulty": "Medium",
            "description": "The Dragonhawk Avatar of Zul'Aman. Third bear run boss. This fight is about egg management - Hatchers periodically spawn to hatch eggs, and at 35% HP ALL remaining eggs hatch at once. Too many dragonhawks = wipe.",
            "bearRunTimer": "Third prisoner - save before killing Jan'alai",
            "phaseBreakdown": [
              "Main Phase: Control Hatchers to manage egg hatching. Keep egg counts balanced between sides.",
              "Fire Bomb Phase: Navigate fire bomb patterns.",
              "35% HP: All remaining eggs hatch. If too many remain, you're overwhelmed."
            ],
            "abilities": [
              {
                "name": "Flame Breath",
                "spellId": 43140,
                "description": "Frontal cone dealing heavy Fire damage.",
                "handling": "Only tank in front. Face boss away from raid."
              },
              {
                "name": "Summon Amani'shi Hatcher",
                "spellId": 43962,
                "description": "Every 90 seconds, two Hatchers spawn (one per side). Each Hatcher runs to eggs and hatches them one at a time.",
                "handling": "CONTROLLED HATCHING: Kill ONE Hatcher immediately. Let the surviving Hatcher hatch a few eggs (3-4) before killing it. Repeat each wave. This controls the flow of adds."
              },
              {
                "name": "Amani Dragonhawk Hatchling",
                "spellId": 0,
                "description": "Small adds hatched from eggs. Low HP but deal Fire damage and pile up.",
                "handling": "AoE them down as they hatch. Don't let them stack up."
              },
              {
                "name": "Fire Bomb",
                "spellId": 42630,
                "description": "Jan'alai teleports to center and spawns fire bombs across the platform in a pattern. Standing in bombs = death.",
                "handling": "When Jan'alai teleports to center, find safe spots between bomb patterns. They explode in sequence, creating safe corridors."
              },
              {
                "name": "Hatch All Eggs",
                "spellId": 43144,
                "description": "At 35% HP, Jan'alai hatches ALL remaining eggs at once.",
                "handling": "CRITICAL: By 35%, you want most eggs already hatched and killed. If 20+ eggs hatch at once, you wipe to dragonhawk swarm."
              }
            ],
            "strategy": "EGG MANAGEMENT: Let Hatchers hatch 3-4 eggs per side, then kill the Hatcher. AoE the dragonhawks as they spawn. Keep egg counts roughly balanced between sides. Goal: Have most eggs hatched and cleared BEFORE 35%. FIRE BOMBS: When Jan'alai teleports to center, stop DPS and focus on avoiding bombs. Find safe spots. FINAL BURN: Below 35%, any remaining eggs hatch. If you managed eggs properly, this is just a few adds. Pop cooldowns and burn Jan'alai.",
            "commonMistakes": [
              "Not controlling Hatchers, leading to egg imbalance",
              "Letting too many eggs survive to 35% - mass hatch overwhelms",
              "Getting hit by Fire Bombs",
              "Not balancing eggs between left and right sides"
            ],
            "lootHighlights": [
              "Mantle of Ill Intent",
              "Jan'alai's Spaulders",
              "Amani Divining Staff",
              "Bulwark of the Amani Empire"
            ]
          },
          {
            "name": "Halazzi",
            "npcId": 23577,
            "difficulty": "Medium",
            "description": "The Lynx Avatar of Zul'Aman. Fourth and final bear run boss. At 75%, 50%, and 25% HP, Halazzi splits into his Troll form and a separate Spirit Lynx that must be off-tanked.",
            "bearRunTimer": "Fourth prisoner - save before killing Halazzi (LAST chance for bear mount)",
            "phaseBreakdown": [
              "Normal Phase: Standard tanking with totem management.",
              "Spirit Phase (75%, 50%, 25%): Halazzi splits into Troll + Spirit Lynx. Off-tank grabs Lynx. Kill Lynx to force merge.",
              "Cycle: Three split phases total."
            ],
            "abilities": [
              {
                "name": "Saber Lash",
                "spellId": 43267,
                "description": "Frontal cleave dealing heavy damage.",
                "handling": "Only tank in front. Face boss away from raid."
              },
              {
                "name": "Frenzy",
                "spellId": 43139,
                "description": "Below 25% HP, Halazzi enrages, increasing attack speed and damage.",
                "handling": "Use Tranquilizing Shot if available, otherwise heal through the increased damage."
              },
              {
                "name": "Spirit of the Lynx",
                "spellId": 43150,
                "description": "At 75%, 50%, and 25% HP, Halazzi splits. The Spirit Lynx spawns as a separate mob and attacks the raid.",
                "handling": "OFF-TANK immediately picks up the Spirit Lynx. DPS kills the Lynx. When Lynx dies, Halazzi reforms and the normal phase resumes."
              },
              {
                "name": "Flame Shock",
                "spellId": 43303,
                "description": "During Spirit Phase, the Troll casts Flame Shock on random players - Fire damage + DoT.",
                "handling": "Dispel the DoT. Heal through initial damage."
              },
              {
                "name": "Corrupted Lightning Totem",
                "spellId": 43302,
                "description": "During Spirit Phase, spawns a totem that deals Nature damage to the raid.",
                "handling": "KILL TOTEM IMMEDIATELY. It does significant damage if left alive."
              },
              {
                "name": "Earth Shock",
                "spellId": 43305,
                "description": "During Spirit Phase, the Troll casts Earth Shock dealing Nature damage.",
                "handling": "Interruptible. Interrupt if possible, otherwise heal through it."
              }
            ],
            "strategy": "NORMAL PHASE: Tank and spank. Face boss away for Saber Lash. SPIRIT PHASE (75%, 50%, 25%): Halazzi splits. Off-tank grabs the Spirit Lynx. Kill the Lightning Totem immediately. DPS burns the Lynx. When Lynx dies, normal phase resumes. REPEAT through all three split phases. BEAR RUN: This is the LAST prisoner. If you're doing bear run, save the prisoner BEFORE engaging.",
            "commonMistakes": [
              "Off-tank not picking up Spirit Lynx quickly",
              "Not killing Lightning Totem - raid takes heavy damage",
              "Not having an off-tank ready for split phases",
              "Missing the fourth prisoner for bear run"
            ],
            "lootHighlights": [
              "Avalanche Leggings",
              "The Savage's Choker",
              "Shoulderpads of Dancing Blades",
              "Elunite Imbued Leggings"
            ]
          },
          {
            "name": "Hex Lord Malacrass",
            "npcId": 24239,
            "difficulty": "Hard",
            "description": "The Hex Lord of Zul'Aman. Fifth boss (not part of bear run). Accompanied by 4 random adds from a pool of 8 possible. His signature ability steals class powers from raid members.",
            "phaseBreakdown": [
              "Single Phase: Kill adds, then burn Malacrass while handling stolen abilities and Spirit Bolts."
            ],
            "randomAdds": [
              "Alyson Antille (Blood Elf Priest) - Heals, must be interrupted",
              "Thurg (Ogre) - Melee with knockback",
              "Slither (Basilisk) - Petrifying gaze",
              "Lord Raadan (Dragonkin) - Flame Breath and Thunderclap",
              "Gazakroth (Imp) - Fire damage",
              "Fenstalker (Sporebat) - Poison and AoE spores",
              "Darkheart (Blackheart the Inciter type) - Mind Control",
              "Koragg (Undead) - Cold damage and curses"
            ],
            "abilities": [
              {
                "name": "Spirit Bolts",
                "spellId": 43383,
                "description": "Every 40 seconds, Malacrass channels Spirit Bolts for 10 seconds, dealing Shadow damage to the entire raid every second.",
                "handling": "Stack for AoE healing during Spirit Bolts. Use healing cooldowns. This is unavoidable raid-wide damage."
              },
              {
                "name": "Siphon Soul",
                "spellId": 43501,
                "description": "Malacrass drains a random player, gaining abilities based on their CLASS for 30 seconds. The drained player is damaged over time.",
                "handling": "VARIES BY CLASS. See stolen abilities below. Heal the drained player. Prepare to counter whatever ability he steals."
              },
              {
                "name": "Drain Power",
                "spellId": 44131,
                "description": "Stacking debuff reducing a stat from the entire raid by 1% per stack. Also buffs Malacrass's damage.",
                "handling": "The fight is a DPS race because of this. The longer it goes, the weaker you get and the stronger he gets."
              },
              {
                "name": "Stolen Abilities (Examples)",
                "spellId": 0,
                "description": "Paladin: Consecration, Holy Light. Priest: Psychic Scream, Heal. Druid: Lifebloom, Thorns. Mage: Frostbolt, Frost Nova. Warlock: Rain of Fire, Curse of Doom. Shaman: Fire Nova Totem, Healing Wave. Hunter: Aimed Shot, Freezing Trap. Warrior: Mortal Strike, Whirlwind. Rogue: Wound Poison, Slice and Dice.",
                "handling": "Interrupt heals he steals. Dispel debuffs. Move out of ground effects. Each stolen ability requires a different response."
              }
            ],
            "strategy": "ADDS FIRST: Kill or CC the 4 random adds. Priority varies by composition - healers/casters first usually. MALACRASS: Tank and spank while handling mechanics. During Spirit Bolts, stack and use AoE healing cooldowns. When he steals abilities via Siphon Soul, respond appropriately (interrupt heals, dispel debuffs, move from ground effects). DPS RACE: Drain Power stacks make this a race. Burn him down before you're too weak.",
            "commonMistakes": [
              "Not killing/CCing dangerous adds (like healing priests)",
              "Not stacking for Spirit Bolts - healing is inefficient",
              "Not countering stolen abilities appropriately",
              "Taking too long and getting overwhelmed by Drain Power stacks"
            ],
            "lootHighlights": [
              "Hex Lord's Voodoo Pauldrons",
              "Tome of Diabolic Remedy",
              "Hex Shrunken Head",
              "Battleworn Tuskguard"
            ]
          },
          {
            "name": "Zul'jin",
            "npcId": 23863,
            "difficulty": "Hard",
            "description": "The legendary Warlord of the Amani trolls and final boss of Zul'Aman. Zul'jin transforms through 5 phases, each channeling a different Loa's animal aspect. Each phase has completely unique mechanics.",
            "phaseBreakdown": [
              "Phase 1 - Troll (100%-80%): Standard melee with Grievous Throw bleed.",
              "Phase 2 - Bear (80%-60%): Heavy tank damage, Creeping Paralysis on raid.",
              "Phase 3 - Eagle (60%-40%): Tornados spawn, constant Nature damage.",
              "Phase 4 - Lynx (40%-20%): Rapid Lynx Rushes on raid, heavy damage.",
              "Phase 5 - Dragonhawk (20%-0%): Fire columns, Flame Breath, burn phase."
            ],
            "abilities": [
              {
                "name": "Grievous Throw",
                "spellId": 43093,
                "description": "Phase 1 only. Throws an axe at a random player, applying a bleed that deals 2,500 damage every 2 seconds until the target is healed to FULL HP.",
                "handling": "HEAL TO FULL. The bleed does NOT stop until the target is at 100% HP. Partial healing just delays the inevitable. Top them off completely."
              },
              {
                "name": "Creeping Paralysis",
                "spellId": 43095,
                "description": "Phase 2 only. Debuff that stacks every 2 seconds, slowing movement. At 4 stacks, the player is stunned for 5 seconds.",
                "handling": "DISPEL before 4 stacks. Druids and Paladins can remove this. If you get stunned, you stop DPSing for 5 seconds."
              },
              {
                "name": "Overpower",
                "spellId": 43456,
                "description": "Phase 2 only. Heavy physical hit on the tank for 12,000-15,000 damage.",
                "handling": "Heavy tank healing required during Bear phase. Use tank cooldowns."
              },
              {
                "name": "Feather Vortex",
                "spellId": 43120,
                "description": "Phase 3 only. Spawns multiple tornados that move around the room. Contact deals Nature damage and knocks you back.",
                "handling": "AVOID TORNADOS. They move in patterns. Keep mobile while DPSing."
              },
              {
                "name": "Energy Storm",
                "spellId": 43983,
                "description": "Phase 3 only. Constant Nature damage to the entire raid throughout the phase.",
                "handling": "AoE healing throughout Phase 3. It's constant - keep the raid topped."
              },
              {
                "name": "Claw Rage",
                "spellId": 43149,
                "description": "Phase 4 only. Zul'jin attacks the tank with extremely rapid melee strikes for several seconds.",
                "handling": "Tank cooldowns. Heavy focused healing. This phase is brutal on tanks."
              },
              {
                "name": "Lynx Rush",
                "spellId": 43153,
                "description": "Phase 4 only. Zul'jin charges random raid members multiple times in quick succession, dealing damage to each.",
                "handling": "Spread out so charges only hit one person. Healers react quickly to each charge target."
              },
              {
                "name": "Flame Whirl",
                "spellId": 43213,
                "description": "Phase 5 only. Spawns columns of fire that move around the room.",
                "handling": "Navigate between fire columns. They persist and limit movement space."
              },
              {
                "name": "Flame Breath",
                "spellId": 43215,
                "description": "Phase 5 only. Frontal cone Fire damage.",
                "handling": "Only tank in front. Face boss away from raid."
              },
              {
                "name": "Pillar of Fire",
                "spellId": 43216,
                "description": "Phase 5 only. Fire erupts under random players.",
                "handling": "Keep moving. Don't stand still."
              }
            ],
            "strategy": "PHASE 1 (Troll): Simple tank and spank. HEAL GRIEVOUS THROW TARGETS TO FULL. PHASE 2 (Bear): Dispel Creeping Paralysis. Heavy tank healing for Overpower. PHASE 3 (Eagle): Avoid tornados while healing through Energy Storm. Keep mobile. PHASE 4 (Lynx): Spread out for Lynx Rush. Tank cooldowns for Claw Rage. Heavy healing phase. PHASE 5 (Dragonhawk): Pop HEROISM/BLOODLUST. Navigate fire columns. Burn him down. This phase is the final burn - use all remaining cooldowns.",
            "commonMistakes": [
              "Not healing Grievous Throw to FULL - bleed never stops",
              "Not dispelling Creeping Paralysis - stuns waste DPS",
              "Getting hit by tornados in Phase 3",
              "Not spreading for Lynx Rush in Phase 4",
              "Not saving Heroism for Phase 5 burn"
            ],
            "lootHighlights": [
              "Chestguard of the Warlord",
              "Cleaver of the Unforgiving",
              "Loop of Cursed Apathy",
              "Bloodsea Brigand's Vest",
              "Trollbane"
            ]
          }
        ]
      }
    }
  },
  "phase5": {
    "name": "Phase 5: Sunwell Plateau",
    "description": "The final and most challenging raid tier of The Burning Crusade. Sunwell Plateau features 6 brutally difficult bosses culminating in the legendary Kil'jaeden encounter. This raid was considered nearly impossible at release and remains the pinnacle of TBC raiding.",
    "raids": {
      "sunwell_plateau": {
        "name": "Sunwell Plateau",
        "shortName": "SWP",
        "size": 25,
        "location": "Isle of Quel'Danas, Quel'Thalas",
        "attunement": "None required (originally gated by patch releases)",
        "description": "The ultimate TBC raid challenge. Sunwell Plateau houses the corrupted Sunwell and Kil'jaeden, one of the most difficult encounters ever created in World of Warcraft. Pre-nerf M'uru was considered literally impossible by some guilds. This raid demands perfection.",
        "recommendedComposition": {
          "tanks": 4,
          "healers": 7,
          "dps": 14,
          "notes": "Extremely high gear requirements. Full BT/Hyjal gear minimum. Multiple Shamans for Heroism cycling. Strong AoE for M'uru. Shadow Resistance useful for several fights."
        },
        "minimumGear": {
          "tanks": "18,000+ health unbuffed, full Tier 6 with multiple resist sets, expertise capped",
          "healers": "2,000+ healing power, 12,000+ mana, Shadow Resistance for Eredar Twins",
          "dps": "Full Black Temple/Hyjal gear minimum. M'uru requires raid-wide 22,000+ DPS. Brutallus is a hard gear check."
        },
        "tierTokens": "Drops Tier 6.5 equivalent gear (ilvl 154-164) and legendary Thori'dal bow",
        "bosses": [
          {
            "name": "Kalecgos",
            "npcId": 24850,
            "difficulty": "Hard",
            "description": "The blue dragon Kalecgos, possessed by the demon Sathrovarr. This unique encounter takes place in two realms simultaneously - the normal realm where you fight Kalecgos, and the demon realm where you fight Sathrovarr. Players rotate between realms via portals.",
            "phaseBreakdown": [
              "Two Simultaneous Fights: Normal Realm (Kalecgos) and Demon Realm (Sathrovarr) run concurrently.",
              "Portal Rotation: Players are periodically teleported to demon realm. After 60 seconds in demon realm, you're teleported back.",
              "Kill Condition: Both Kalecgos AND Sathrovarr must die within 10 seconds of each other."
            ],
            "realmMechanics": {
              "normalRealm": "Fight Kalecgos (dragon form). Tank him facing away. Avoid Frost Breath. Tank swaps for Arcane Buffet stacks.",
              "demonRealm": "Fight Sathrovarr. More dangerous - Curse of Boundless Agony must be dispelled. Shadow Bolt Volley requires heavy healing.",
              "portalTransition": "Spectral Blast teleports random players to demon realm. You stay there 60 seconds, then return to normal realm."
            },
            "abilities": [
              {
                "name": "Arcane Buffet",
                "spellId": 45018,
                "description": "Normal Realm: Stacking Arcane debuff on the tank, increasing Arcane damage taken by 500 per stack. Stacks indefinitely.",
                "handling": "Tank swap at 10-12 stacks. Two tanks rotate in normal realm."
              },
              {
                "name": "Frost Breath",
                "spellId": 44799,
                "description": "Normal Realm: Frontal cone dealing 10,000+ Frost damage.",
                "handling": "Only tank in front. Face Kalecgos away from raid."
              },
              {
                "name": "Spectral Blast",
                "spellId": 44869,
                "description": "Teleports random players to the Demon Realm to fight Sathrovarr.",
                "handling": "When teleported, immediately engage Sathrovarr. You'll fight in demon realm for 60 seconds before returning."
              },
              {
                "name": "Tail Lash",
                "spellId": 45122,
                "description": "Normal Realm: Damages and knocks back anyone behind Kalecgos.",
                "handling": "Don't stand directly behind the dragon."
              },
              {
                "name": "Curse of Boundless Agony",
                "spellId": 45034,
                "description": "Demon Realm: DoT that deals increasing Shadow damage over time. When dispelled or expires, it jumps to nearby players.",
                "handling": "MUST be dispelled. Affected player should move away from others before dispel to prevent spreading."
              },
              {
                "name": "Shadow Bolt Volley",
                "spellId": 45031,
                "description": "Demon Realm: AoE Shadow damage to everyone in demon realm.",
                "handling": "Heavy AoE healing required in demon realm."
              },
              {
                "name": "Corrupting Strike",
                "spellId": 45029,
                "description": "Demon Realm: Sathrovarr's main tank attack.",
                "handling": "Keep demon realm tank alive. Tank swap for debuffs if needed."
              }
            ],
            "strategy": "REALM MANAGEMENT: Start with main tank on Kalecgos, off-tank ready for demon realm. As players get teleported via Spectral Blast, they engage Sathrovarr in demon realm. NORMAL REALM: Tank Kalecgos, swap at 10+ Arcane Buffet stacks. Avoid breath. DEMON REALM: Dispel Curse of Boundless Agony carefully (spread first). Heavy AoE healing through Shadow Bolt Volley. KILL TIMING: Both bosses must die within 10 seconds. Coordinate DPS between realms - use voice comms to call HP percentages. If one dies and the other survives 10 seconds, the dead one resurrects.",
            "commonMistakes": [
              "Not dispelling Curse of Boundless Agony, causing escalating damage",
              "Dispelling Curse without spreading, causing it to chain",
              "Killing one boss too far ahead of the other",
              "Not having tanks ready in both realms"
            ],
            "lootHighlights": [
              "Fang of Kalecgos",
              "Pantaloons of Calming Strife",
              "Legplates of the Holy Juggernaut",
              "Bracers of the Forgotten Conqueror"
            ]
          },
          {
            "name": "Brutallus",
            "npcId": 24882,
            "difficulty": "Very Hard",
            "description": "A massive Pit Lord and one of the most infamous gear check bosses in WoW history. Brutallus is a pure DPS race with a tight 6-minute enrage timer. The mechanics are simple but demanding - stack for Meteor Slash, run out with Burn. If your raid doesn't have enough DPS, you literally cannot win.",
            "phaseBreakdown": [
              "Single Phase: Pure DPS race. Stack for Meteor Slash, run out with Burn. Beat the 6-minute enrage or wipe."
            ],
            "gearCheck": {
              "requiredRaidDPS": "Approximately 22,000-23,000 raid DPS to beat the enrage timer",
              "tankRequirements": "Tanks need 20,000+ HP, high avoidance. Brutallus hits HARD.",
              "notes": "Full BT/Hyjal gear is the minimum. Full consumables (flasks, food, elixirs, weapon oils) are mandatory."
            },
            "abilities": [
              {
                "name": "Meteor Slash",
                "spellId": 45150,
                "description": "Every 12 seconds, Brutallus slams the ground in front of him, dealing 20,000 Fire damage SPLIT among all players hit. Also increases Fire damage taken by 75% for 40 seconds (stacks).",
                "handling": "ENTIRE RAID stacks in front of Brutallus to split damage. With 25 people, each person takes ~800 damage. With 5 people, each takes 4,000. The stacking debuff makes this deadly if not split properly."
              },
              {
                "name": "Burn",
                "spellId": 45141,
                "description": "Places a DoT on a random player dealing 3,000 Fire damage per tick, increasing by 100% every 10 seconds. When the debuff expires or is dispelled, it jumps to the nearest player.",
                "handling": "BURN TARGET RUNS OUT of the raid immediately. Stay out until debuff expires (60 seconds). If you stay in the raid, when Burn jumps it'll spread to someone stacking for Meteor Slash."
              },
              {
                "name": "Stomp",
                "spellId": 45185,
                "description": "AoE attack dealing 4,000-6,000 Physical damage to everyone within 15 yards and knocking them back.",
                "handling": "Affects melee and tanks. Healers be ready for burst damage on melee group."
              }
            ],
            "strategy": "POSITIONING: Everyone stacks in front of Brutallus to split Meteor Slash. Two tanks swap due to Stomp knockback. BURN: When you get Burn, RUN OUT immediately. Go to a designated spot away from the raid. Wait 60 seconds for it to expire. DO NOT DISPEL - dispelling makes it jump instantly. ENRAGE: You have 6 minutes. This is a hard DPS check. If you don't have the gear, you cannot win. Pop Heroism at the start, use all cooldowns on cooldown. Full consumables mandatory.",
            "commonMistakes": [
              "Not stacking for Meteor Slash - people get one-shot",
              "Burn targets not running out - Burn chains through the raid",
              "Dispelling Burn instead of letting it expire",
              "Not having enough raid DPS to beat the 6-minute enrage"
            ],
            "lootHighlights": [
              "Heart of the Pit",
              "Leggings of Calamity",
              "Boots of the Forgotten Protector",
              "Collar of the Pit Lord"
            ]
          },
          {
            "name": "Felmyst",
            "npcId": 25038,
            "difficulty": "Very Hard",
            "description": "The reanimated corpse of Madrigosa, corrupted by Brutallus's fel energy. Felmyst alternates between Ground Phase (standard dragon fight) and Air Phase (the infamous breath mechanic). One hit from Fog of Corruption in air phase means mind control and likely wipe.",
            "phaseBreakdown": [
              "Ground Phase (60 seconds): Standard dragon tanking with tank swaps. Gas Nova and Encapsulate mechanics.",
              "Air Phase (60 seconds): Felmyst flies and breathes Demonic Vapor three times. Anyone hit is mind controlled. Skeletal adds spawn.",
              "Cycle: Alternates until dead."
            ],
            "abilities": [
              {
                "name": "Cleave",
                "spellId": 19983,
                "description": "Ground Phase: Frontal cleave dealing heavy Physical damage.",
                "handling": "Only tank in front."
              },
              {
                "name": "Corrosion",
                "spellId": 45866,
                "description": "Ground Phase: Stacking armor debuff on the tank, reducing armor by 10% per stack.",
                "handling": "Tank swap at 5-6 stacks."
              },
              {
                "name": "Gas Nova",
                "spellId": 45855,
                "description": "Ground Phase: AoE dealing 2,500 Nature damage and knocking back everyone within 20 yards.",
                "handling": "Spread loosely, heal through the damage."
              },
              {
                "name": "Encapsulate",
                "spellId": 45665,
                "description": "Ground Phase: Traps a random player in a cyclone, dealing damage over time and making them unable to act.",
                "handling": "Heavy healing on encapsulated player. They can't do anything but take damage."
              },
              {
                "name": "Demonic Vapor (Fog of Corruption)",
                "spellId": 45402,
                "description": "Air Phase: Felmyst flies over the raid THREE TIMES, breathing a trail of green fog. The fog persists on the ground. Anyone who touches the fog is MIND CONTROLLED for the rest of the fight.",
                "handling": "ABSOLUTE PRIORITY: Do not touch the green fog. When air phase starts, pre-position at safe spots. Watch where Felmyst flies and move to avoid the breath path. Mind controlled players gain 500% damage and must be killed."
              },
              {
                "name": "Unyielding Dead",
                "spellId": 45524,
                "description": "Air Phase: Skeleton adds spawn that must be controlled.",
                "handling": "Off-tank picks up skeletons. AoE them down between breaths."
              }
            ],
            "strategy": "GROUND PHASE: Tank Felmyst normally. Tank swap at 5-6 Corrosion stacks. Spread loosely for Gas Nova. Heavy heal Encapsulate targets. DPS burns. AIR PHASE: When Felmyst takes off, move to PRE-ASSIGNED SAFE SPOTS. Watch her flight path. She'll breath three times, each leaving a trail of fog. STAY OUT OF THE FOG. Kill skeleton adds between breaths. After third breath, return to ground phase positions. REPEAT until dead. One person touching fog often means a wipe.",
            "commonMistakes": [
              "Touching Demonic Vapor fog - instant mind control",
              "Not having pre-assigned safe spots for air phase",
              "Not tank swapping for Corrosion stacks",
              "Not healing Encapsulate targets"
            ],
            "lootHighlights": [
              "Bracers of the Forgotten Vanquisher",
              "Sword Breaker's Bulwark",
              "Heal of the Forgotten Protector",
              "Borderland Fortress Grips"
            ]
          },
          {
            "name": "Eredar Twins",
            "npcId": 25166,
            "difficulty": "Hard",
            "description": "Lady Sacrolash (Shadow) and Grand Warlock Alythess (Fire) - twin Eredar commanders. They must be tanked 40+ yards apart and killed within 15 seconds of each other. The twist: being hit by one sister's abilities makes you take MORE damage from the other sister.",
            "phaseBreakdown": [
              "Single Phase: Tank twins apart. DPS splits based on debuffs. Kill within 15 seconds of each other."
            ],
            "debuffMechanic": {
              "darkTouched": "Applied by Sacrolash abilities. Makes you take 25% MORE Fire damage. Removes Fire Touched.",
              "fireTouched": "Applied by Alythess abilities. Makes you take 25% MORE Shadow damage. Removes Dark Touched.",
              "strategy": "Players with Dark Touched should DPS Sacrolash (Shadow). Players with Fire Touched should DPS Alythess (Fire). This minimizes damage taken."
            },
            "abilities": [
              {
                "name": "Shadow Nova",
                "spellId": 45329,
                "description": "Sacrolash: AoE Shadow damage around her, applies Dark Touched.",
                "handling": "Spread out near Sacrolash to minimize splash. Dark Touched players move to Alythess."
              },
              {
                "name": "Confounding Blow",
                "spellId": 45256,
                "description": "Sacrolash: Confuses her tank for 4 seconds.",
                "handling": "Off-tank taunts when main tank is confused."
              },
              {
                "name": "Shadow Blades",
                "spellId": 45248,
                "description": "Sacrolash: Throws shadow blades at random targets.",
                "handling": "Heal through it."
              },
              {
                "name": "Conflagration",
                "spellId": 45342,
                "description": "Alythess: Burns a random player, dealing Fire damage and spreading fire to nearby players.",
                "handling": "Conflag target runs away from others immediately. Applies Fire Touched."
              },
              {
                "name": "Flame Sear",
                "spellId": 46771,
                "description": "Alythess: Fire damage to random players.",
                "handling": "Heal through it."
              },
              {
                "name": "Blaze",
                "spellId": 45235,
                "description": "Alythess: Places a fire patch under a random player.",
                "handling": "Move out of fire."
              },
              {
                "name": "Pyrogenics",
                "spellId": 45230,
                "description": "Alythess: Increases Fire damage dealt by nearby allies.",
                "handling": "Keep twins separated to prevent buff stacking."
              }
            ],
            "strategy": "POSITIONING: Tank Sacrolash on one side, Alythess on the other, at least 40 yards apart. DPS splits into two groups. DEBUFF MANAGEMENT: If you get Dark Touched (from Sacrolash), move to fight Alythess (she does Fire, you resist Shadow). If you get Fire Touched (from Alythess), move to fight Sacrolash. This minimizes cross-damage. KILL TIMING: Both must die within 15 seconds. Call HP percentages. Balance DPS. If one dies and the other lives 15 seconds, the dead one resurrects at full HP and the survivor enrages.",
            "commonMistakes": [
              "Twins too close together - abilities overlap",
              "Not swapping based on debuffs - taking extra damage",
              "Killing one twin too far ahead - resurrection triggers",
              "Conflagration target not running out"
            ],
            "lootHighlights": [
              "Belt of the Forgotten Vanquisher",
              "Grip of Mannoroth",
              "Boots of the Forgotten Conqueror",
              "Sin'dorei Pendant of Triumph"
            ]
          },
          {
            "name": "M'uru",
            "npcId": 25741,
            "difficulty": "Very Hard",
            "description": "A corrupted Naaru that transforms into the void god Entropius. Pre-nerf M'uru was considered by many to be THE hardest boss in TBC history. Phase 1 is an insane add management challenge. Phase 2 is a pure burn race with void zones. Many guilds broke on this fight.",
            "phaseBreakdown": [
              "Phase 1 (M'uru): Fight the Naaru while managing two types of add waves spawning from portals. Constant raid damage. Chaos.",
              "Phase 2 (Entropius): M'uru transforms into Entropius when reaching 0 HP. Pure burn race with void zones and increasing damage."
            ],
            "addManagement": {
              "humanoids": "Spawn from LEFT portal every 30 seconds. Include Fury Mages (Pyroblast) and Berserkers (melee). CC Mages, kill Berserkers.",
              "voidSentinels": "Spawn from RIGHT portal every 30 seconds. Large adds with high HP. Off-tanks pick up and burn down.",
              "darkFiends": "Spawn periodically and chase random players. Kite and AoE.",
              "priority": "Void Sentinels > Humanoid Fury Mages > Humanoid Berserkers > Dark Fiends"
            },
            "abilities": [
              {
                "name": "Negative Energy",
                "spellId": 46285,
                "description": "Phase 1: Constant Shadow damage pulse to the entire raid every 3 seconds.",
                "handling": "Non-stop AoE healing required throughout Phase 1."
              },
              {
                "name": "Darkness",
                "spellId": 45996,
                "description": "Phase 1: Creates a dark zone that deals Shadow damage to anyone inside.",
                "handling": "Move out of Darkness zones."
              },
              {
                "name": "Summon Void Sentinel",
                "spellId": 46087,
                "description": "Phase 1: Large add spawning from the right portal. High HP, hits hard.",
                "handling": "Off-tank picks up immediately. DPS burns. Shadow Resistance gear helps."
              },
              {
                "name": "Summon Dark Fiend",
                "spellId": 46268,
                "description": "Phase 1: Small adds that fixate on random players and explode on contact.",
                "handling": "Kite away from raid. AoE them down."
              },
              {
                "name": "Void Zone",
                "spellId": 46262,
                "description": "Phase 2: Black holes spawn under random players, dealing massive Shadow damage.",
                "handling": "MOVE OUT immediately. The room fills with void zones over time."
              },
              {
                "name": "Singularity",
                "spellId": 46228,
                "description": "Phase 2: Entropius periodically pulls all players toward him.",
                "handling": "Run against the pull. Don't get dragged into void zones."
              },
              {
                "name": "Negative Energy (Phase 2)",
                "spellId": 46284,
                "description": "Phase 2: Increased raid-wide Shadow damage compared to Phase 1.",
                "handling": "Massive healing required. Use all healing cooldowns."
              }
            ],
            "strategy": "PHASE 1: Split raid for add management. One group handles humanoids (left), one handles Void Sentinels (right). CC Fury Mages or they Pyroblast the raid. Burn Void Sentinels fast. Kite Dark Fiends. Constant AoE healing for Negative Energy. DPS M'uru whenever possible. PHASE 2: M'uru transforms to Entropius at 0 HP. BURN PHASE. Pop Heroism/Bloodlust. Avoid void zones. Run against Singularity pull. Spam healing through escalating damage. Kill Entropius before the room fills with void zones and healing can't keep up. This fight is pure chaos - execution must be perfect.",
            "commonMistakes": [
              "Not controlling Fury Mages - Pyroblasts one-shot people",
              "Void Sentinels overwhelming tanks - not enough DPS on adds",
              "Standing in void zones in Phase 2",
              "Getting pulled into void zones by Singularity",
              "Running out of healing throughput in Phase 2"
            ],
            "lootHighlights": [
              "Shoulders of the Forgotten Vanquisher/Protector/Conqueror",
              "Sin'dorei Band of Triumph",
              "Muramasa",
              "Shifting Naaru Sliver"
            ]
          },
          {
            "name": "Kil'jaeden",
            "npcId": 25315,
            "difficulty": "Very Hard",
            "description": "The Deceiver, Lord of the Burning Legion, and the final boss of The Burning Crusade. Kil'jaeden emerges from the Sunwell in an epic encounter spanning multiple phases. The infamous Darkness of a Thousand Souls requires precise use of Dragon Orbs. Defeating Kil'jaeden is the crowning achievement of TBC raiding.",
            "phaseBreakdown": [
              "Phase 1 (100%-85%): Introduction. Basic abilities, learning the mechanics.",
              "Phase 2 (85%-55%): Shield Orbs spawn. Flame Darts add raid damage.",
              "Phase 3 (55%-25%): Darkness of a Thousand Souls cast. Dragon Orbs must be used to shield the raid.",
              "Phase 4 (25%-0%): Armageddon meteors. Sinister Reflections. Final burn."
            ],
            "dragonOrbs": {
              "description": "During Phase 3+, Dragon Orbs appear around the room. Players can click them to summon a blue dragon that shields the raid for 20 seconds. This shield is REQUIRED to survive Darkness of a Thousand Souls.",
              "usage": "Assign specific players to each orb. When Darkness begins casting, the assigned player clicks their orb immediately.",
              "timing": "Darkness cast is 8 seconds. Click orb as soon as cast starts."
            },
            "abilities": [
              {
                "name": "Soul Flay",
                "spellId": 45442,
                "description": "Shadow bolt on the tank dealing 4,500-5,500 Shadow damage.",
                "handling": "Keep tank topped off."
              },
              {
                "name": "Legion Lightning",
                "spellId": 45664,
                "description": "Chain lightning hitting the target and jumping to nearby players for increasing damage.",
                "handling": "Spread out to limit chain jumps."
              },
              {
                "name": "Fire Bloom",
                "spellId": 45641,
                "description": "Fire debuff that deals damage and jumps to a nearby player when it expires or is dispelled.",
                "handling": "Spread out so jumps hit only one person. Affected players move away from others."
              },
              {
                "name": "Shield Orb",
                "spellId": 45680,
                "description": "Phase 2+: Orbs that orbit Kil'jaeden, shielding him and shooting Shadow Bolts at the raid.",
                "handling": "Ranged DPS prioritizes killing Shield Orbs quickly. They reduce damage on KJ and add raid damage."
              },
              {
                "name": "Flame Dart",
                "spellId": 45737,
                "description": "Phase 2+: Fire damage to random players.",
                "handling": "Heal through it. Unavoidable."
              },
              {
                "name": "Darkness of a Thousand Souls",
                "spellId": 46605,
                "description": "Phase 3+: 8-second cast dealing ~50,000 Shadow damage to the entire raid when it completes. Unsurvivable without Dragon Orbs.",
                "handling": "CRITICAL: Assigned player clicks Dragon Orb immediately when cast starts. The dragon's shield absorbs the damage. Without it, everyone dies."
              },
              {
                "name": "Armageddon",
                "spellId": 45909,
                "description": "Phase 4: Meteors fall from the sky. Standing in the meteor's shadow when it lands splits the damage. Not standing in it lets it hit full damage to the area.",
                "handling": "Players MUST stand in meteor shadows to soak them. Multiple players per meteor. If no one soaks, massive raid damage. If one person soaks alone, they die."
              },
              {
                "name": "Sinister Reflection",
                "spellId": 45785,
                "description": "Phase 4: Creates shadow copies of 4 random players. The reflections have class abilities and attack the raid.",
                "handling": "CC and kill reflections quickly. They use player abilities - healer reflections heal KJ, DPS reflections hurt the raid."
              }
            ],
            "strategy": "PHASE 1-2: Tank and spank. Spread for Fire Bloom and Legion Lightning. Kill Shield Orbs quickly. PHASE 3: DARKNESS IS COMING. Assign players to Dragon Orbs before the fight. When Darkness of a Thousand Souls begins casting, assigned player clicks their orb to spawn the protective dragon. Without this shield, the raid dies. PHASE 4: Pop HEROISM/BLOODLUST. Soak Armageddon meteors with multiple players per shadow. CC and kill Sinister Reflections immediately. Burn Kil'jaeden. This is the culmination of TBC raiding - executing Phase 4 perfectly while burning the boss is the ultimate test.",
            "commonMistakes": [
              "Not clicking Dragon Orb during Darkness - raid wipes",
              "Wrong person clicks orb - orb on cooldown for next Darkness",
              "Not enough people soaking Armageddon meteors",
              "Not killing Sinister Reflections - healer copies heal KJ",
              "Not spreading for Fire Bloom - chains through raid",
              "Shield Orbs left alive too long - reduces DPS window"
            ],
            "lootHighlights": [
              "Thori'dal, the Stars' Fury (Legendary Bow - no ammo needed)",
              "Helm of the Forgotten Vanquisher/Protector/Conqueror",
              "Cover of Ursol the Wise",
              "Thalassian Ranger Gauntlets",
              "Duplicitous Guise"
            ]
          }
        ]
      }
    }
  }
}